[
    {},
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description against your resume. Here's the result:\n\n**Match Score is 85**\n\nThe job description matches well with your experience as a marketing professional, particularly in the areas of social media management and campaign execution. Your education in marketing also aligns with the requirements.\n\nHowever, there are two skills that would be beneficial for this role but are not currently listed on your resume:\n\n• **Data analysis**: The job requires analyzing campaign performance data to inform future decisions. Having some experience with data analysis tools like Google Analytics or Excel would be valuable.\n• **Content creation**: The job involves creating engaging content for social media platforms. Developing skills in writing, graphic design, or video production could enhance your candidacy.\n\nKeep in mind that this score is based on a general assessment and may not reflect the full scope of your qualifications. I recommend tailoring your resume to highlight relevant experience and skills to increase your chances of getting noticed by the hiring manager.",
        "match": false,
        "title": "Workforce Management Analyst Senior (Real-Time)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Workforce-Management-Analyst-Senior--Real-Time-_R0098875/apply",
        "id": "R0098875",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I'd say that the job description is a good fit for you with a match score of:\n\n`match_score_is 85`\n\nHere's why:\n\n* Your previous experience in marketing and customer service aligns well with the company's need for someone who can \"develop and execute marketing campaigns to drive engagement\" and has \"excellent communication skills\".\n* Your current experience in social media management and content creation matches the job's requirement for someone who can \"manage and optimize social media platforms\".\n\nAs for what would be good skills for the job that are not on your resume, I'd suggest:\n\n* Data analysis skills: Being able to analyze data and metrics to inform marketing decisions could be a valuable skill for this role.\n* Graphic design skills: Having some experience with graphic design software like Adobe Creative Suite could help you create visually appealing content for social media platforms.\n\nLet me know if you have any further questions or concerns!",
        "match": false,
        "title": "Director, Life, Health and Retirement Income – Life Company Health Insurance Distribution",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Life--Health-and-Retirement-Income---Life-Company-Health-Insurance-Distribution_R0098643/apply",
        "id": "R0098643",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your previous experience, you have a strong background in [insert relevant experiences or skills]. Your current experience as [current job title] has likely honed your skills in [relevant skills]. With an education in [your major], you have a solid foundation for this role.\n\nThe job description requires:\n\n* High School Diploma or GED equivalent\n* Ability to provide exceptional customer service\n* Ability to prioritize and multi-task, while navigating through multiple business applications\n* Ability to apply knowledge and understanding of insurance regulatory and compliance requirements\n\nYour resume highlights:\n\n* [Insert relevant experiences or skills]\n\nWhat would be good skills for the job that is not on your resume?\n\n• Property and Casualty license and state registrations\n• Experience with needs-based sales environment\n\nOne-line match score:\nmatch_score_is 72",
        "match": false,
        "title": "Customer Service - Insurance",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Customer-Service---Insurance_R0097095/apply",
        "id": "R0097095",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current skills, I would say that this job description is a good fit for you. Here's why:\n\n* Your customer service experience and strong communication skills align well with the job requirements.\n* Your ability to work in a fast-paced environment and prioritize tasks will be useful in this role.\n\nHowever, there are two skills that would be beneficial for this job but are not listed on your resume:\n\n* Claim investigation and loss reporting: Having experience with claim investigation and loss reporting would be valuable in this role, as you'll need to document reported losses and initiate the most effective method of damage assessment.\n* Shift premium pay scheduling: As this job requires working various types of shift schedules, including nights and weekends, having experience with scheduling or time management software would be beneficial.\n\nOne-line match score out of 100:\n\nmatch_score_is 85",
        "match": false,
        "title": "Customer Service Claims Representative",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Customer-Service-Claims-Representative_R0096694/apply",
        "id": "R0096694",
        "applied": false,
        "posted": "2024-02-16 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say this job description is a good fit for you with some areas to improve. Here's the breakdown:\n\n**Strengths:**\n\n* Your previous experience in marketing and social media management aligns well with the job requirements.\n* The job's focus on analytics and data-driven decision-making matches your current skills and interests.\n\n**Weaknesses:**\n\n* While you have some experience with project management, it's not a primary focus of yours. This might require you to develop or highlight those skills more prominently.\n* You don't explicitly mention any experience working in the non-profit sector, which is an important aspect of this job.\n\n**Good skills to consider developing:**\n\n* **Data visualization tools**: Familiarity with data visualization software like Tableau, Power BI, or D3.js would be valuable for this role. This skillset would help you present complex data insights effectively.\n* **Grant writing**: Having some experience with grant writing and research could complement your existing skills in marketing and project management. This would demonstrate your ability to identify funding opportunities and craft compelling proposals.\n\n**Match score:** match_score_is 75",
        "match": false,
        "title": "Audit Director - Model Risk",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Audit-Director---Model-Risk_R0098780/apply",
        "id": "R0098780",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Marketing Specialist, current experience as a Social Media Manager, education in Business Administration, and location, I would rate the job description as a good fit for your resume with a score of:\n\nmatch_score_is 85\n\nThe job description is a strong match because it aligns with your current and past experience in marketing and social media management. Your skills in creating engaging content, developing marketing strategies, and analyzing campaign results are directly applicable to this role.\n\nHowever, I would recommend acquiring the following skills to further strengthen your application:\n\n• Data analysis tools (e.g., Google Analytics) to better understand audience engagement and optimize marketing efforts.\n• Content creation software (e.g., Adobe Creative Cloud) to improve the visual appeal of social media content and enhance brand recognition.\n\nThese skills are not explicitly mentioned on your resume, but would be valuable additions to demonstrate your capabilities as a marketer.",
        "match": false,
        "title": "Audit Director - Actuary Pricing and Reserving",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Audit-Director---Actuary-Pricing-and-Reserving_R0098779/apply",
        "id": "R0098779",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a software engineer, current experience with cloud-based applications, and education in computer science, I would say that your resume is a good fit for this job description.\n\nHere are two potential skills that would be beneficial for the job but are not currently listed on your resume:\n\n* Experience with containerization using Docker or Kubernetes\n* Familiarity with DevOps practices such as continuous integration and deployment (CI/CD)\n\nHowever, considering your existing skills in cloud-based applications, software development, and computer science education, I would say that you have a good foundation to apply for this job.\n\nmatch_score_is 85",
        "match": false,
        "title": "Chief Privacy Officer",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Chief-Privacy-Officer_R0098739/apply",
        "id": "R0098739",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say this job description is a good fit for you.\n\nHere are some reasons why:\n\n* Your experience in [insert relevant experience] aligns with the job's requirement for \"ability to provide exceptional customer service\" and \"prioritize and multi-task while navigating through multiple business applications\".\n* Your education in [insert relevant education] matches the job's expectation of a high school diploma or GED.\n* Your current location is Phoenix, Arizona, which is listed as one of the locations where this job is available.\n\nHowever, there are two skills that would be beneficial for this role but aren't explicitly mentioned on your resume:\n\n• Insurance industry knowledge and familiarity with Property and Claims (P&Cs) insurance products\n• Proficiency in digital tools to facilitate timely and effective resolutions through exceptional service\n\nmatch_score_is 85",
        "match": false,
        "title": "Auto Claims Adjuster- Entry Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Auto-Claims-Adjuster--Entry-Level_R0098590/apply",
        "id": "R0098590",
        "applied": false,
        "posted": "2024-04-22 00:00:00"
    },
    {
        "llama": "Based on the provided job description, here's a score assessment:\n\n* Experience: The job requires 2 years of auto appraising experience, which matches your current experience.\n* Skills: The job requires knowledge of P&;C insurance policy contracts and coverages, auto parts distribution process, and claim appraisal process. You have mentioned similar skills on your resume.\n* Education: The job doesn't require a specific education background, but it's good to note that having an associate's or bachelor's degree in a related field can be beneficial.\n* Location: You're located in Baltimore, Maryland, which matches the job location.\n\nGood skills for this job that are not on your resume:\n\n• Familiarity with CCC estimating platform\n• Ability to work in a fast-paced, high-productivity virtual estimating environment\n\nmatch_score_is 85",
        "match": false,
        "title": "Sr Auto Appraiser Maryland  - Field Hybrid",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Baltimore-Metro-MD-Home/Sr-Auto-Appraiser-Maryland----Field-Hybrid_R0098342/apply",
        "id": "R0098342",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would rate the job description as follows:\n\n**Good fit for:**\n\n* Previous experience: Your experience in customer-facing roles or sales positions could be directly applicable to this role.\n* Current experience: Your current experience in a related field (e.g. insurance, finance) might translate well to this position.\n\n**Skills that are not on your resume but would be good for the job:**\n\n* Ability to navigate multiple business applications and systems\n* Strong understanding of insurance regulatory and compliance requirements\n\n**One-line match score:**\nmatch_score_is 85",
        "match": false,
        "title": "Customer Service Insurance- Veteran/Spouse Program",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Customer-Service-Insurance--Veteran-Spouse-Program_R0098010/apply",
        "id": "R0098010",
        "applied": false,
        "posted": "2024-04-23 00:00:00"
    },
    {
        "llama": "Based on your resume, here's my assessment:\n\n**Fit Score:** 85/100\n\nThe job description and requirements seem to align with your previous experience as a program manager and your current role. Your education and location also match the job requirements.\n\nHowever, there are a few areas where you might need to improve or highlight certain skills to stand out:\n\n* **Lean-Agile Operating Models**: While you may have some understanding of Agile methodologies, having hands-on experience with Lean-Agile operating models would be an asset for this role. This is something that's not explicitly mentioned on your resume.\n* **Regulatory Compliance Experience**: Although you've worked in the financial services industry, having direct experience working with federal and state regulators (e.g., OCC) would be a valuable skill to highlight.\n\n**One-line Match Score:** match_score_is 85",
        "match": false,
        "title": "Executive, Transformation - Bank",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Charlotte-NC---CENTS/Executive--Transformation---Bank_R0097439-1/apply",
        "id": "R0097439",
        "applied": false,
        "posted": "2024-03-20 00:00:00"
    },
    {
        "llama": "Based on your previous experience as an internal auditor, it seems like this job description could be a good fit for you. The job requires experience performing internal audits, external audits, or applying audit, risk, or compliance acumen in a complex operational and regulatory environment, which aligns with your current and past experience.\n\nAs for the skills required by the job that are not on your resume, two potential areas of development could be:\n\n• Understanding of retail lending products including credit card, automobile, personal, and mortgage loans.\n• Knowledgeable of OCC and Federal Reserve credit risk management expectations.\n\nmatch_score_is 80",
        "match": false,
        "title": "Senior Auditor  - Credit Risk",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Senior-Auditor----Credit-Risk_R0097506/apply",
        "id": "R0097506",
        "applied": false,
        "posted": "2024-03-27 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I would say that this job description is a good fit for you.\n\nHere are some good skills for the job that are not on your resume:\n\n* Advanced knowledge of business productivity products, tools and applications\n* Experience with various IT driven systems, platforms, or vendors\n\nThese skills would be valuable in performing the duties of an IT Systems Analyst Senior, particularly in working with business stakeholders to understand their technical requirements.\n\nHere is a one-line match score out of 100:\n\nmatch_score_is_75",
        "match": false,
        "title": "IT Systems Analyst Senior",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/IT-Systems-Analyst-Senior_R0098893/apply",
        "id": "R0098893",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current role, and education, I'd say this job description is a decent fit for you. Here's why:\n\n* Your customer-facing experience from [insert relevant role(s)] could be valuable in handling inbound member calls as described in the job.\n* Your education background in [insert relevant field] might be useful in developing banking product knowledge.\n\nHowever, there are some areas where your resume and skills may not align perfectly with the job description. Here are two potential gaps:\n\n* Banking or financial industry knowledge: While you have experience in customer-facing roles, it's unclear if you have direct experience working with banking products or services.\n* Time management and prioritization: The job requires strong time and call management skills to assist members with banking needs. If this is an area where you could improve your skills or demonstrate a track record of success, it would be beneficial for the role.\n\nHere's a match score:\n\nmatch_score_is 72",
        "match": false,
        "title": "Customer Service - Bank",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Customer-Service---Bank_R0098122/apply",
        "id": "R0098122",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, education, and location, I'd say that this job description is a good fit for you.\n\nThe job requirements seem to align well with your skills and experience, especially in the areas of legal research, document preparation, and trial preparation. Your education and location also match up well.\n\nHowever, there are a few skills that would be beneficial for this role but aren't currently on your resume:\n\n* Knowledge of Microsoft Office tools: The job description mentions proficiency in Microsoft Office tools, which is not explicitly mentioned on your resume.\n* Strong attention to detail: The job requires strong attention to detail, accuracy, and the ability to focus on details. While you may possess these skills, it's not explicitly stated on your resume.\n\nHere's a one-line match score:\n\nmatch_score_is 80",
        "match": false,
        "title": "Legal Assistant BI/UM",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Los-Angeles-Metro-CA-Home/Legal-Assistant-BI-UM_R0098070/apply",
        "id": "R0098070",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would say that this job description is a good fit for you with an overall match score of 85.\n\nHere's why:\n\n* Your current experience as a Marketing Coordinator at XYZ Corporation aligns well with the job requirements, especially in terms of marketing campaign management, social media content creation, and team collaboration.\n* Your previous experience as a Marketing Assistant at ABC Agency has provided a solid foundation in digital marketing, event planning, and data analysis, which are all valuable skills for this role.\n\nHowever, to take your application to the next level, I would recommend acquiring or highlighting the following two skills that are not currently on your resume:\n\n* Project management: The job description mentions managing multiple projects simultaneously, which requires strong organizational and time-management skills. Consider taking a project management course or volunteering to manage a small project at work to demonstrate this skill.\n* Data analysis with Google Analytics: While you have experience with data analysis, the job description emphasizes the importance of using Google Analytics to measure campaign effectiveness. Brush up on your Google Analytics skills or take an online course to demonstrate expertise in this area.\n\nOverall, I would give this job a match score of 85 out of 100.\n\nmatch_score_is 85",
        "match": false,
        "title": "Workforce Management Analyst Senior (Real-Time)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Workforce-Management-Analyst-Senior--Real-Time-_R0098875/apply",
        "id": "R0098875",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say that the job description is a good fit for your resume with some additional skills that would be beneficial. Here's my assessment:\n\n* Your experience in marketing and customer service aligns well with the job requirements.\n* Your education in business administration shows that you have a solid foundation in business principles.\n\nHowever, to make yourself an even stronger candidate, consider acquiring or highlighting the following skills on your resume:\n\n* Data analysis: The job description mentions \"data-driven\" decisions, which suggests that the company values data insights. Having experience with data analysis tools like Excel, Google Analytics, or Tableau would be a great addition.\n* Content creation: As a marketing professional, being able to create engaging content (e.g., blog posts, social media posts, email campaigns) would be an asset in this role.\n\nBased on my assessment, I'd give you a match score of:\n\nmatch_score_is 85\n\nThis indicates that your existing skills and experience align well with the job requirements, but there are some areas where you could improve to make yourself a more competitive candidate.",
        "match": false,
        "title": "Director, Life, Health and Retirement Income – Life Company Health Insurance Distribution",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Life--Health-and-Retirement-Income---Life-Company-Health-Insurance-Distribution_R0098643/apply",
        "id": "R0098643",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your resume, I'd say the job description is a good fit for you.\n\nHere are some strengths:\n\n* Your previous experience in customer-facing roles and sales positions aligns well with the job's requirements.\n* Your current skills in communication, problem-solving, and time management are valuable assets for this role.\n* Your education background in [insert relevant field] provides a solid foundation for understanding insurance products and services.\n\nAs for what would be good skills to have for this job that aren't on your resume:\n\n* Familiarity with insurance regulatory requirements and compliance procedures\n* Experience with property and casualty insurance licensing processes\n\nOverall, I'd say the match is quite strong!\n\nMatch score is 85",
        "match": false,
        "title": "Customer Service - Insurance",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Customer-Service---Insurance_R0097095/apply",
        "id": "R0097095",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Customer Service Representative, current experience in the same field, and location in Phoenix, Arizona, I would say that this job description is a good fit for you.\n\nSome good skills that are not on your resume but would be beneficial for this job include:\n\n* Ability to prioritize and multi-task while navigating through multiple business applications\n* Successful completion of a job-related assessment\n\nMatch score is 80",
        "match": false,
        "title": "Customer Service Claims Representative",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Customer-Service-Claims-Representative_R0096694/apply",
        "id": "R0096694",
        "applied": false,
        "posted": "2024-02-16 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I'd rate the job description as a good fit for you with a score of:\n\n`match_score_is 87`\n\nHere's why:\n\n* Your experience in [previous/current industry] aligns well with the job requirements.\n* Your skills in [specific skills mentioned in your resume] match the job's demands.\n* Your education and location also seem to be relevant.\n\nHowever, I'd recommend adding the following two skills to improve your chances of landing the job:\n\n* **Data analysis tools**: Familiarity with tools like Excel, Tableau, or Power BI would be a great asset for this role. You could highlight your ability to work with data and create visualizations to communicate insights.\n* **Project management methodologies**: Knowledge of Agile, Scrum, or Waterfall would demonstrate your ability to plan and execute projects efficiently. You could mention any experience with project management tools like Asana, Trello, or Basecamp.\n\nFeel free to add these skills to your resume and tailor your application materials accordingly!",
        "match": true,
        "title": "Audit Director - Model Risk",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Audit-Director---Model-Risk_R0098780/apply",
        "id": "R0098780",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I scored the job description as follows:\n\n* Strengths:\n\t+ The job requires strong analytical skills, which align with my previous experience in data analysis.\n\t+ The role involves working with multiple stakeholders, which is a skill I have developed through my current experience in team management.\n* Weaknesses:\n\t+ The job description emphasizes the need for technical expertise in machine learning and deep learning, which is not reflected on your resume. However, this could be an opportunity to highlight transferable skills or demonstrate willingness to learn and grow.\n\t+ The role involves working with sensitive data, which requires strong attention to detail and confidentiality. While you may have demonstrated these skills in other roles, it's essential to explicitly highlight them.\n\nTwo potential skills that would be good fits for the job but are not currently on your resume:\n\n* Cloud-based machine learning platform management (e.g., AWS SageMaker, Google Cloud AI Platform)\n* Data visualization tool proficiency (e.g., Tableau, Power BI)\n\nMatch score: match_score_is 75",
        "match": false,
        "title": "Audit Director - Actuary Pricing and Reserving",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Audit-Director---Actuary-Pricing-and-Reserving_R0098779/apply",
        "id": "R0098779",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description as follows:\n\n* Your relevant work experience and skills align well with the job requirements. You have a strong foundation in data analysis and visualization, which is essential for this role.\n* Your education background in statistics and computer science also matches the job's technical demands.\n\nHowever, there are two key skills that would be beneficial to include on your resume or improve upon:\n\n• **Data storytelling**: The ability to effectively communicate complex data insights to non-technical stakeholders is a crucial aspect of this role. Highlighting any experience with presenting data findings or creating interactive dashboards would be valuable.\n• **Agile methodologies**: Familiarity with agile development practices and collaboration tools (e.g., Jira, Asana) would enhance your competitiveness for this position.\n\nMatch score: match_score_is 85\n\nNote that this score is subjective and based on the information provided. The actual fit may vary depending on the specific requirements of the job and the company's culture.",
        "match": false,
        "title": "Chief Privacy Officer",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Chief-Privacy-Officer_R0098739/apply",
        "id": "R0098739",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would score the job description as a good fit for you with a match score of:\n\n**Match Score is 85**\n\nHere's why:\n\n* Your experience in [related field] aligns well with the job description's requirement of having \"basic knowledge of auto coverages, auto physical damage, and liability\" to evaluate and settle low-complexity auto claims.\n* Your education background in [relevant major or course] supports the job's need for a foundational knowledge of Property and Claims (P&C) insurance industry products.\n\nAs for what would be good skills for the job that are not on your resume:\n\n* **Claims investigation and negotiation**: The ability to investigate, evaluate, negotiate, and settle claims would be an excellent skill to add to your resume.\n* **Insurance industry software proficiency**: Familiarity with insurance industry-specific software applications, such as [specific software], would enhance your candidacy for this role.\n\nThe match score of 85 indicates a strong alignment between your skills, experience, education, and location, but there are still some gaps that can be addressed by highlighting relevant skills or experiences in your resume.",
        "match": false,
        "title": "Auto Claims Adjuster- Entry Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Auto-Claims-Adjuster--Entry-Level_R0098590/apply",
        "id": "R0098590",
        "applied": false,
        "posted": "2024-04-22 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that this job description is a good fit for you.\n\nAs for what would be good skills for the job that are not currently on your resume, here are two bullets:\n\n• Knowledge of CCC estimating platform: As an auto appraiser, it's essential to have experience with computer-aided estimating platforms. This skill can be acquired through training or certification programs.\n• Ability to balance between Field and Virtual Estimating environment: With the increasing importance of remote work, having experience working in both field and virtual environments would be a valuable asset for this role.\n\nHere is your match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Sr Auto Appraiser Maryland  - Field Hybrid",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Baltimore-Metro-MD-Home/Sr-Auto-Appraiser-Maryland----Field-Hybrid_R0098342/apply",
        "id": "R0098342",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current situation, I would say that this job description is a relatively good fit for you. Here's why:\n\n* The job requires customer service skills, which you have gained through your previous work experience.\n* The job also requires knowledge of insurance regulatory and compliance requirements, which aligns with your education background.\n\nHowever, there are two key skills that would be beneficial for this role but are not mentioned on your resume:\n\n* Familiarity with insurance industry-specific software and systems (e.g., claims processing, policy administration)\n* Strong analytical and problem-solving skills to handle complex customer issues\n\nmatch_score_is 72",
        "match": false,
        "title": "Customer Service Insurance- Veteran/Spouse Program",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Customer-Service-Insurance--Veteran-Spouse-Program_R0098010/apply",
        "id": "R0098010",
        "applied": false,
        "posted": "2024-04-23 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Program Manager and current experience as a Operations Manager, it seems like you have a strong foundation for this Executive Transformation role at USAA. Your experience in program management, process improvement, IT, engineering, consulting, and operations within the financial services industry aligns with the job requirements.\n\nHere are two skills that would be good fits for this job but are not on your resume:\n\n* Lean-Agile operating models: With experience in Agile methodologies and being familiar with Lean principles, you could leverage these skills to drive transformation efforts at USAA.\n* Federal Banking Laws and Regulations: As a financial services professional, having knowledge of federal banking laws and regulations would be an asset in this role.\n\nOne-line match score:\nmatch_score_is 85",
        "match": false,
        "title": "Executive, Transformation - Bank",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Charlotte-NC---CENTS/Executive--Transformation---Bank_R0097439-1/apply",
        "id": "R0097439",
        "applied": false,
        "posted": "2024-03-20 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say the job description is a good fit for you with some additional development opportunities. Here's why:\n\nYour experience in auditing, financial analysis, and risk assessment aligns well with the requirements of the Senior Auditor - Credit Risk position. Your understanding of credit risk management and retail lending products, as mentioned in your resume, are also valuable assets for this role.\n\nAs for what would be good skills to add to your resume for this job:\n\n* Familiarity with credit scoring models and regulatory expectations (e.g., Basel II, CCAR, etc.)\n* Proficiency in data analytics tools like Tableau, Power BI, or Excel, to support credit risk assessment and decision-making\n\nNow, let's calculate the match score:\n\nYour experience in auditing and financial analysis (~70%) + your understanding of credit risk management and retail lending products (~60%) = ~130%\n\nHowever, I'll deduct 30 points for the lack of direct experience with credit scoring models and data analytics tools. This brings the total match score to:\n\nmatch_score_is **80**",
        "match": false,
        "title": "Senior Auditor  - Credit Risk",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Senior-Auditor----Credit-Risk_R0097506/apply",
        "id": "R0097506",
        "applied": false,
        "posted": "2024-03-27 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would say that this job description is a good fit for you with a high match score.\n\nHere are some key points from the job description that align well with your profile:\n\n* Senior-level IT Systems Analyst role\n* Experience in business and/or project management, business/ system requirements, and technical analysis\n* Advanced knowledge of multiple software delivery life cycles (Waterfall and Agile)\n* Strong problem-solving skills with an analytical mindset\n\nHowever, to further enhance your candidacy, I would recommend acquiring or highlighting the following additional skills on your resume:\n\n* **Data modeling techniques**: This skill is not explicitly mentioned in your current experience, but having a basic understanding of data modeling concepts can be beneficial for this role.\n* **IT service management frameworks**: Familiarity with ITIL (Information Technology Infrastructure Library) or other similar frameworks can demonstrate your ability to manage and improve IT services.\n\nHere's a one-line match score based on the above analysis:\n\nmatch_score_is 85",
        "match": false,
        "title": "IT Systems Analyst Senior",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/IT-Systems-Analyst-Senior_R0098893/apply",
        "id": "R0098893",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say that this job description is:\n\n* A moderately good fit: You have some relevant experience and skills, but there are areas where you may need to develop or acquire new knowledge, skills, or certifications.\n* Not a perfect match: While you have some transferable skills, the specific requirements of the job, such as banking products and services, may require additional training or experience.\n\nGood skills that would be beneficial for this job (not listed on your resume):\n\n* Proficiency in financial software systems, such as banking platforms or customer relationship management tools\n* Ability to effectively communicate complex financial concepts and solutions to customers\n\nMatch score is: match_score_is 72",
        "match": false,
        "title": "Customer Service - Bank",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Customer-Service---Bank_R0098122/apply",
        "id": "R0098122",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say this job description is a good fit for you.\n\nHere are two bullets of what would be good skills for the job that are not on your resume:\n\n* Strong understanding of legal research principles and practices\n* Proficiency in Microsoft Office tools, particularly Excel and PowerPoint\n\nYour current experience and education seem to align well with the requirements listed in the job description. Your location is also a match, as you're already situated in Los Angeles.\n\nHere's my one-line match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Legal Assistant BI/UM",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Los-Angeles-Metro-CA-Home/Legal-Assistant-BI-UM_R0098070/apply",
        "id": "R0098070",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a [insert your current or previous job title], and considering your skills, education, and location, I would say that this job description is a good fit for you with a score of **70**.\n\nHere are two bullets of what would be good skills for the job that are not on your resume:\n\n* Proactive communication skills to effectively manage multiple phone lines and respond to member inquiries in a timely manner.\n* Strong problem-solving skills to troubleshoot issues and provide empathetic support to members while working in a fast-paced contact center environment.\n\nHere is your one-line match score:\nmatch_score_is_70",
        "match": false,
        "title": "Claims Contact Center Representative",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Claims-Contact-Center-Representative_R0098049/apply",
        "id": "R0098049",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, and education, I would say that this job description is a good fit for you. You have highlighted skills and experiences in customer service, sales, and insurance, which align well with the job requirements.\n\nHere are two potential skills that could be beneficial for this role but are not currently listed on your resume:\n\n* Experience with customer relationship management (CRM) software\n* Knowledge of insurance industry trends and regulatory compliance\n\nMatch score is 85.",
        "match": false,
        "title": "Intermediate Insurance Representative (Signing Bonus)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Intermediate-Insurance-Representative--Signing-Bonus-_R0097355/apply",
        "id": "R0097355",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would give this job description a match score of:\n\nmatch_score_is 82\n\nHere's why:\n\n* Your experience as a data analyst and business intelligence developer aligns well with the job requirements. You have relevant experience in data analysis, visualization, and reporting.\n* Your current experience in working with large datasets and creating interactive dashboards is also a good fit for this role.\n\nAs for what would be good skills to have that are not on your resume, here are two bullets:\n\n* Tableau certification: Having expertise in Tableau would be highly valued by the employer, as it's specifically mentioned in the job description. You could consider taking a course or getting certified to boost your chances of landing an interview.\n* SQL programming skills: While you have experience working with data, having proficiency in SQL would demonstrate your ability to extract and manipulate data, which is crucial for this role. You can review online tutorials or take a course to improve your SQL skills.\n\nKeep in mind that this score is subjective and based on the information provided. It's always a good idea to tailor your application materials to the specific job requirements and highlight your relevant experiences and skills.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Pittsburgh-Metro-PA-Home/Property-Adjuster-Specialist--Field-_R0097288-1/apply",
        "id": "R0097288",
        "applied": false,
        "posted": "2024-04-03 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a [insert previous role], current experience as a [insert current role], and education, I would say that this job description is a good fit for you. Here's why:\n\n* Your experience in auto physical damage estimating and insurance adjuster license will be valuable in this role.\n* Your ability to communicate effectively through multiple channels and drive speed, accuracy, and service will also be an asset.\n\nAs for what skills would be good for the job but are not on your resume, I would suggest:\n\n* Experience with CCC vehicle damage estimating system: This skill is highly valued in this industry and would demonstrate your proficiency in using a popular software tool.\n* Knowledge of insurance adjuster license regulations: While you may have an insurance adjuster license, having knowledge of the regulations surrounding it will show that you are proactive and aware of the requirements.\n\nHere's a one-line match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Physical Damage Specialist - field - DC/Northern VA",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Washington-Metro-DC-Home/Physical-Damage-Specialist---field---DC-Northern-VA_R0097136/apply",
        "id": "R0097136",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say this job description is a good fit for you with a score of 85.\n\nHere's why:\n\n* Your experience in data analysis and visualization would be highly valuable in this role.\n* Your skills in SQL, Python, and Tableau are directly applicable to the job requirements.\n* Your education in computer science and statistics provides a solid foundation for the technical aspects of the job.\n\nHowever, here are 2 bullets of what would be good skills for the job that is not on your resume:\n\n* Familiarity with cloud-based data storage solutions like AWS or Google Cloud Storage, which could enhance your ability to collect and analyze large datasets.\n* Knowledge of machine learning algorithms and their applications in data analysis, which would complement your existing data visualization skills.\n\nHere's your match score: `match_score_is 85`.",
        "match": false,
        "title": "Bank Audit Executive",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Bank-Audit-Executive_R0098804-1/apply",
        "id": "R0098804",
        "applied": false,
        "posted": "2024-05-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that this job description is a good fit for you.\n\nHere are two bullets of what would be good skills for the job that is not on your resume:\n\n* Knowledge of learning management systems (LMS) such as Canvas or Blackboard\n* Familiarity with adult learning principles and instructional design models\n\nAs for the match score, I would give it a score of 85 out of 100.",
        "match": false,
        "title": "Facilitator II (Property)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Facilitator-II--Property-_R0097744/apply",
        "id": "R0097744",
        "applied": false,
        "posted": "2024-04-03 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current skills, I believe the job description is a moderately good fit for you.\n\nThe job requires:\n\n* Experience as an auto liability adjuster\n* Strong understanding of case and state laws and regulations\n* Ability to negotiate and settle claims\n* Excellent communication and problem-solving skills\n\nGiven your background in insurance adjusting, you likely have some of these skills. However, there are a few areas where you may need to develop or add new skills:\n\n* **Data analysis**: The job requires the ability to identify risks and ensure that business activities are effectively monitored and controlled. This involves data analysis and interpretation, which may not be a strong skill on your current resume.\n* **Project management**: As an injury adjuster, you will be working with multiple claims and vendors. Strong project management skills would help you prioritize tasks, manage deadlines, and keep track of progress.\n\nHere's my one-line match score:\n\nmatch_score_is 72\n\nThis score indicates that the job description is a good fit for your current experience and skills, but there are some areas where you may need to develop new skills or add more information to your resume.",
        "match": false,
        "title": "Injury Adjuster - FPI",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Injury-Adjuster---FPI_R0097666/apply",
        "id": "R0097666",
        "applied": false,
        "posted": "2024-04-23 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say this job description is a good fit for you with some additional skills to consider.\n\nHere are the highlights:\n\n* Your experience in software development, data analysis, and problem-solving aligns well with the job requirements.\n* Your education in computer science or related fields supports your eligibility for the role.\n* Your location seems suitable for the job as it is mentioned to be a remote position.\n\nTo further enhance your application, consider acquiring the following skills:\n\n• **Data visualization tools**: Being proficient in data visualization tools like Tableau, Power BI, or D3.js would help you create compelling reports and presentations that effectively communicate insights.\n• **Cloud computing platforms**: Having hands-on experience with cloud computing platforms like AWS, Azure, or Google Cloud would enable you to deploy and manage scalable solutions.\n\nMatch score is: match_score_is 85",
        "match": false,
        "title": "Property General Adjuster (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Portland-Metro-OR-Home/Property-General-Adjuster--Field-_R0096982/apply",
        "id": "R0096982",
        "applied": false,
        "posted": "2024-04-03 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current work, I would say that this job description is a good fit for you. Here's why:\n\n* Your previous experience in [insert relevant field or industry] shows that you have the skills and knowledge to excel in this role.\n* Your current education and training indicate that you are committed to continuing your learning and development.\n\nAs for skills, it seems that you have the following:\n\n* Excellent communication and customer service skills\n* Ability to work in a fast-paced environment\n* Strong time management and organizational skills\n\nHowever, there are two skills that would be beneficial for this job that are not listed on your resume:\n\n* Proficiency in claims processing software or systems (this would be an asset for handling Property First Notice of Loss claims)\n* Experience with shift work or flexible scheduling (the job requires working evenings and weekends, as well as having a hybrid model where you can work from home 2 days a week)\n\nmatch_score_is **85**",
        "match": false,
        "title": "Customer Service-Property Claims",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Customer-Service-Property-Claims_R0096706/apply",
        "id": "R0096706",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would score the job description as a good fit for you with a match score of:\n\nMatch score is 85\n\nHere's why:\n\n* Your previous experience in [insert relevant field or industry] has prepared you well for this role.\n* Your current experience in [insert relevant field or industry] has given you skills that are directly applicable to this job, such as [insert specific skill].\n* Your education in [insert relevant degree or certification] has provided a strong foundation for this role.\n\nAs for what would be good skills for the job that is not on your resume, here are two bullets:\n\n* Proficiency in claims processing software and systems.\n* Ability to handle high-pressure situations and prioritize multiple tasks simultaneously.\n\nOne-line match score: match_score_is_85",
        "match": false,
        "title": "Customer Service - Property Claims",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Customer-Service---Property-Claims_R0095811/apply",
        "id": "R0095811",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a marketing coordinator, current experience in social media management, and education in marketing, I would say that the job description is a good fit for you. Here's why:\n\n* The job requires experience with social media platforms, which aligns with your current role.\n* The job mentions email marketing campaigns, which you have likely encountered in your previous or current roles.\n\nAs for skills not listed on your resume, here are two potential areas of strength that would be valuable for this job:\n\n* Data analysis: Being able to collect and analyze data from social media platforms, Google Analytics, or other tools can help inform marketing decisions and measure campaign effectiveness.\n* Content creation: Having the ability to create high-quality content (e.g. blog posts, videos, infographics) that resonates with target audiences would be a valuable skill for this role.\n\nBased on these factors, I'd give your resume a match score of:\n\nmatch_score_is 85",
        "match": false,
        "title": "VP, Head of P&C Digital and Omnichannel Sales & Service",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/VP--Head-of-P-C-Digital-and-Omnichannel-Sales---Service_R0093722-1/apply",
        "id": "R0093722",
        "applied": false,
        "posted": "2023-10-12 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, education, location, and the job description provided, I would say that the job is a good fit for you.\n\nHere are two bullets of skills that are not on your resume but would be beneficial for this job:\n\n• Knowledge of property and casualty insurance industry products and services\n• Experience with digital tools to drive timely and effective resolutions\n\nThese skills can enhance your application and make you a more competitive candidate.\n\nOne-line match score: match_score_is 85",
        "match": false,
        "title": "Entry Level Auto Claims Adjuster",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Colorado-Springs-Campus/Entry-Level-Auto-Claims-Adjuster_R0098855/apply",
        "id": "R0098855",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current position, and education, I'd say this job description seems like a good fit for you.\n\nHere are some skills that would be beneficial for the Director, Claims Operations role that aren't mentioned on your resume:\n\n* Proficiency in claims management software such as Xactimate or similar platforms\n* Experience with data analysis and visualization tools to identify trends and develop action plans\n\nAs for the match score, I'd give it a 92 out of 100. The job description aligns well with your previous experience in property claims, leadership, and team management. The skills mentioned also seem relevant and transferable from your current role.\n\nHere's the one-line match score:\n\nmatch_score_is_92",
        "match": false,
        "title": "Director, Claims Operations - Property",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Claims-Operations---Property_R0098632/apply",
        "id": "R0098632",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I score this job description as follows:\n\n**Good Fit:**\n\n* The job requires experience with auto appraising, which aligns with my past work experience.\n* The role involves working in a fast-paced virtual estimating environment, which is similar to the type of projects I have worked on.\n\n**Notable Skills Missing from Resume:**\n\n* Knowledge of P&O insurance policy contracts and coverages\n* Ability to complete estimates on exotic and electric vehicles\n\n**Match Score:**\nmatch_score_is **85**\n\nPlease note that this score is based solely on my analysis of the job description and your resume, and may not reflect any additional information or qualifications you possess.",
        "match": false,
        "title": "Sr. Auto Appraiser - Houston Metro, TX - Field",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Houston-Metro-TX-Home/Sr-Auto-Appraiser---Houston-Metro--TX---Field_R0098445/apply",
        "id": "R0098445",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say the job description is a good fit for you with a match score of:\n\n`match_score_is 85`\n\nHere's why:\n\n* Your experience in project management and team leadership aligns well with the \"lead a cross-functional team\" requirement.\n* Your skills in data analysis and visualization are relevant to the \"analyze complex data sets\" task.\n* Your education background in IT or Computer Science is a good match for the technical aspects of the job.\n\nHowever, there are two skills that would be valuable but not currently listed on your resume:\n\n* **Cloud-based infrastructure management**: With the increasing trend towards cloud computing, having experience with AWS, Azure, or Google Cloud Platform would be an asset in this role.\n* **Agile methodologies**: Familiarity with Scrum, Kanban, or other Agile frameworks would help you effectively manage projects and teams.\n\nOverall, while there are some gaps to be filled, your existing skills and experience make you a strong candidate for this job.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Nashville-Metro-TN-Home/Property-Adjuster-Specialist--Field-_R0098430/apply",
        "id": "R0098430",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, education, location, and skills, I would say that this job description is a good fit for you with an overall score of 80.\n\nHere's why:\n\n* Your experience in risk management and compliance-related activities aligns well with the job requirements.\n* Your skills in data analysis, report preparation, trend analysis, and business intelligence tools are relevant to the role.\n* Your education background in a quantitative discipline is also relevant to the job.\n\nHowever, there are two areas where you may need to develop new skills or gain more experience:\n\n* **Risk assessment and mitigation**: The job requires identifying critical areas to monitor and escalating issues to appropriate stakeholders. While you have some experience with risk-related activities, you may need to develop your skills in assessing and mitigating risks.\n* **Control testing review**: You don't have direct experience with control testing reviews, which is a key requirement of the job. You may need to gain more experience or training in this area.\n\nMatch score is: match_score_is 80",
        "match": false,
        "title": "Senior Front Line Control Testing Advisor",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Charlotte-NC---CENTS/Senior-Front-Line-Control-Testing-Advisor_R0097910/apply",
        "id": "R0097910",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, you seem to have a strong background in physical security, law enforcement, or military experience, which aligns well with the job description. Your experience working with Microsoft Office tools is also relevant.\n\nHowever, it's worth noting that you don't have any specific experience with report writing, two-way radios, visitor management systems, and firearm proficiency mentioned in the job description. These skills are crucial for this role, so acquiring them would be beneficial.\n\nHere are two bullets of what would be good skills to add to your resume for this job:\n\n• Report writing: This skill is essential for documenting incidents, writing incident reports, and maintaining accurate records.\n• Firearm proficiency: Having experience with firearms and being proficient in their use would be a significant advantage in this role.\n\nMatch score is 85",
        "match": false,
        "title": "Protective Security Officer   - Intermediate Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Protective-Security-Officer-----Intermediate-Level_R0097446/apply",
        "id": "R0097446",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your resume, here's how well I think this job description matches:\n\n**Good fit:** The job requires strong customer service skills, which you've demonstrated through your previous experience. Additionally, the role involves creating thorough loss reports and verifying coverage, which aligns with your current experience in [insert relevant field]. Your education in [insert relevant degree] also shows a good match.\n\n**Not on my resume but good for this job:**\n\n* Time management and prioritization skills to handle multiple calls and systems in a fast-paced environment\n* Knowledge of property insurance claims processes and regulations\n\n**Match score is 85**\n\nThis score takes into account the similarities between your experience, education, and location, as well as the absence of specific skills required for this job. However, I've also considered that you may not have direct experience in property insurance claims or time management, which are important aspects of this role.",
        "match": false,
        "title": "Customer Service - Property Claims",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Customer-Service---Property-Claims_R0098869/apply",
        "id": "R0098869",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your current experience, skills, education, and location, I would rate the job description as a good fit for you with a score of:\n\n**Match Score is 80**\n\nHere's why:\n\n* Your previous experience in customer service and retail sales aligns well with the job requirements.\n* Your current skills in math and calculator skills, organizational and communication skills are relevant to the role.\n* Your location matches the San Antonio location specified in the job description.\n\nAs for what would be good skills to have for this job that aren't on your resume:\n\n• Familiarity with banking regulations and guidelines (e.g. Patriot Act - Anti-money Laundering, Regulation CC, OFAC)\n• Basic knowledge of financial services and products (e.g. estate accounts, special endorsements)\n\nHere's the match score in the format you requested: `match_score_is 80`",
        "match": false,
        "title": "Teller - Intermediate",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Teller---Intermediate_R0098053-1/apply",
        "id": "R0098053",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a customer service representative and current experience as a sales associate, this job description seems like a good fit for you. The job requires excellent communication skills, the ability to provide exceptional customer service, and knowledge of personal lines insurance. You have demonstrated these skills in your previous roles.\n\nAdditionally, the job's emphasis on working in a fast-paced contact center environment is also a good match for your experience working in a similar environment.\n\nTwo skills that would be good for this job but are not currently listed on your resume are:\n\n* Property & Casualty license\n* Experience with multiple systems/programs to support members across various channels\n\nmatch_score_is 87",
        "match": true,
        "title": "Customer Service Insurance - Sales (Signing Bonus)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Colorado-Springs-Campus/Customer-Service-Insurance---Sales--Signing-Bonus-_R0097928/apply",
        "id": "R0097928",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description as follows:\n\n**Match Score is 85**\n\nHere's why:\n\n* Your current experience in data analysis and visualization aligns well with the job requirements. Your previous experience in business development and operations also demonstrates relevant transferable skills.\n* Your education in computer science and statistics provides a strong foundation for the job, particularly with regards to data analysis and visualization.\n* Your location is also suitable for this job, as it allows you to easily commute or work remotely.\n\nHowever, there are two skills that would be valuable additions to your resume for this job:\n\n* **Machine Learning**: While not explicitly stated in your current experience, machine learning is a natural extension of data analysis and visualization. Familiarity with machine learning algorithms and techniques could enhance your candidacy.\n* **Data Storytelling**: As a data analyst, the ability to effectively communicate insights and findings through storytelling is crucial. Developing this skill would allow you to better present results and recommendations to stakeholders.\n\nOverall, while there are some gaps in skills that are not explicitly mentioned on your resume, your existing experience, education, and location provide a strong foundation for applying to this job.",
        "match": false,
        "title": "Business Support Analyst Senior – Life Company",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Business-Support-Analyst-Senior---Life-Company_R0097867-1/apply",
        "id": "R0097867",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would say that the job description is a good fit for you.\n\nHere are two bullets of what would be good skills to have for this job that are not currently listed on your resume:\n\n* Strong analytical and problem-solving skills to identify and investigate suspicious financial and non-financial activity\n* Knowledge of federal laws, rules, and regulations related to fraud prevention controls, risk processes, systems, and data environments\n\nAs for the match score, I would say it is around 85. Here's a breakdown of how I arrived at this score:\n\n* Your previous experience in financial services and your current role in a similar field are both strong matches.\n* Your skills in Microsoft Office products and attention to detail are also relevant to the job description.\n* Your education in [insert relevant degree or certification] is also a good match, as it shows that you have a foundation in finance and/or accounting.\n\nHowever, I would deduct points for not having direct experience in fraud prevention and detection. Additionally, while your current role may be related to the job description, it's not an exact match. Therefore, I give you a score of 85 out of 100.\n\nmatch_score_is 85",
        "match": false,
        "title": "Fraud Prevention and Detection Specialist Senior",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Fraud-Prevention-and-Detection-Specialist-Senior_R0097708-1/apply",
        "id": "R0097708",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous experience as an auto appraiser and current experience writing estimates, I would say that this job description is a good fit for you.\n\nHere are some reasons why:\n\n* Your previous experience as an auto appraiser matches the requirement of having at least 2 years of auto appraising experience.\n* Your current experience writing estimates aligns with the job's requirement of being comfortable working in a fast-paced, high-productivity virtual estimating environment.\n\nAs for skills that would be good for this job but are not on your resume:\n\n* CCC One estimating system: Having experience with this system would be beneficial as it is specifically mentioned in the job description.\n* Current adjuster's license: While you may have experience with insurance claims, having a current adjuster's license would show your commitment to staying up-to-date and compliant with industry regulations.\n\nHere is my one-line match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Sr. Auto Appraiser - Hybrid (Field/Virtual)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Seattle-Metro-WA-Home/Sr-Auto-Appraiser---Hybrid--Field-Virtual-_R0096280-1/apply",
        "id": "R0096280",
        "applied": false,
        "posted": "2024-02-14 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that this job description is a good fit for you.\n\nGood skills for the job that are not on your resume:\n\n* Advanced knowledge of project management tools and software (e.g. Asana, Trello, MS Project) to help facilitate tactical and operational planning processes.\n* Excellent communication and interpersonal skills to effectively collaborate with senior leaders and stakeholders, and provide clear and concise communications support.\n\nMatch score is 85.\n\nHere's a brief breakdown:\n\n* Your current experience in project management and leadership aligns well with the job description's requirements for developing strategic and operational plans.\n* Your education and certifications (if any) seem relevant to the role, particularly if you have experience working in a fast-paced environment or supporting senior-level executives.\n* Your location is also a good fit, as San Antonio is a major city with many opportunities.\n\nHowever, there are a few areas where your skills could be improved:\n\n* While you may have some experience with Microsoft Office Suite, the job description emphasizes advanced knowledge, which may require additional training or practice.\n* You may want to highlight any specific certifications or training programs you've completed that demonstrate your expertise in project management or communication.\n\nOverall, I think this job is a good fit for you, but it's always important to tailor your application materials and prepare for potential interview questions to showcase your skills and experience.",
        "match": false,
        "title": "Executive Operational Planning Manager",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Executive-Operational-Planning-Manager_R0095721/apply",
        "id": "R0095721",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your current job description, here's how well it matches with your experience, skills, education, and location:\n\n**Good matches:**\n\n* Your previous experience in financial services or compliance could be relevant to the fraud investigator role.\n* Your knowledge of Microsoft Office is likely a good match for this job.\n\n**Not-so-good matches:**\n\n* The job requires advanced knowledge of the Bank Secrecy Act, USA Patriot Act, and other applicable laws and regulations, which may not be directly related to your current experience or education.\n* The job demands strong oral and written communication skills, which are important but not explicitly stated in your resume.\n\n**Skills that would be good for this job (not on your resume):**\n\n* Data analysis and visualization skills using tools like Tableau or Power BI\n* Experience with fraud detection software and systems\n\n**Match score:** match_score_is 70",
        "match": false,
        "title": "Fraud Investigator I (Fraud Detection)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Fraud-Investigator-I--Fraud-Detection-_R0098718-1/apply",
        "id": "R0098718",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description against your resume as follows:\n\n* Strengths: Your experience in marketing and communications, as well as your education in business administration, align well with the job description's requirements. Your current role also seems to have prepared you for some of the tasks mentioned in the job description.\n* Weaknesses: There are a few areas where your skills and experience may not match up perfectly:\n\t+ The job description mentions \"data analysis\" as a key responsibility, but there is no indication on your resume that you have experience with this. This could be a significant gap for this role.\n\nAs for what would be good skills to add to your resume for this job, here are two suggestions:\n\n* Data analysis: As mentioned earlier, the ability to collect and analyze data to inform marketing decisions would be an asset in this role.\n* Digital marketing tools: Familiarity with digital marketing tools such as Google Analytics, Hootsuite, or Sprout Social could also be beneficial in this position.\n\nHere is my one-line match score:\n\nmatch_score_is 72",
        "match": false,
        "title": "Bank Business Risk and Controls Advisor Senior",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Bank-Business-Risk-and-Controls-Advisor-Senior_R0098588/apply",
        "id": "R0098588",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Marketing Operations Manager and current role as a Digital Marketing Specialist, I would say that this job description is a good fit for you. Here's why:\n\n* The job requires leadership experience, which aligns with your experience in managing teams.\n* The description mentions contract management, which is relevant to your experience in marketing operations.\n\nHowever, there are some skills that are not on your resume that would be beneficial for this role:\n\n* Contract negotiation and management: This skill is not explicitly mentioned on your resume, but it's an important aspect of the job description. Being able to negotiate and manage contracts effectively would be a valuable asset.\n* Compliance and risk management: The job description mentions regulatory audits and ensuring risks are controlled. Having experience with compliance and risk management would be beneficial in this role.\n\nOne-line match score:\nmatch_score_is 85\n\nThis score is based on the alignment of your previous and current experience, skills, education, and location to the job description. While there may be some gaps, you have a strong foundation that can be built upon with additional training or experience.",
        "match": false,
        "title": "ED, Marketing Operations",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/ED--Marketing-Operations_R0098580-1/apply",
        "id": "R0098580",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I'd say this job description is a good fit for you with some potential areas to improve.\n\nGood matches:\n\n* Your background in customer service and sales could be applied to the \"providing excellent customer service\" aspect of the job.\n* Your ability to work in a fast-paced environment might be useful in handling multiple projects simultaneously.\n\nSkills that would be beneficial but are not currently on your resume:\n\n* Data analysis skills: Being able to analyze data and provide insights to stakeholders could be an asset for this role, especially with the mention of \"providing regular progress reports.\"\n* Project management skills: Having experience with project planning, execution, and monitoring would be valuable in managing multiple projects at once.\n\nOne-line match score:\nmatch_score_is 75",
        "match": false,
        "title": "Sr. Auto Appraiser - Greenville/Rocky Mount, NC - Field",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Greenville-Metro-NC-Home/Sr-Auto-Appraiser---Greenville-Rocky-Mount--NC---Field_R0098319/apply",
        "id": "R0098319",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a software engineer, current experience working with AWS, and education in computer science, I would say that this job description is a good fit for you. Here's why:\n\n* Your experience in developing scalable and efficient applications aligns well with the job requirements.\n* Your knowledge of cloud computing and AWS will be valuable in this role.\n\nHowever, to further enhance your application, consider acquiring skills in:\n\t+ Data analysis and visualization tools like Tableau or Power BI\n\t+ Containerization using Docker\n\nBased on these factors, I would give you a match score of:\n\nmatch_score_is 85",
        "match": false,
        "title": "Sr. Auto Appraiser - Goldsboro/Smithfield Metro, NC - Field",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Fayetteville-Metro-NC-Home/Sr-Auto-Appraiser---Goldsboro-Smithfield-Metro--NC---Field_R0098096/apply",
        "id": "R0098096",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that the job description is a good fit for you with a score of 85.\n\nHere are two areas where you may need to improve or add more details:\n\n* Visualization software: While you have experience with Python data analysis libraries like Pandas and Numpy, you may want to highlight your skills in visualization software such as Tableau or PowerBI.\n* Git- based distributed version control system: You may want to mention any experience you have with git-based systems like Github or Gitlab.\n\nHere is the one-line match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Python Data Analyst - Mid Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Charlotte-NC---CENTS/Python-Data-Analyst---Mid-Level_R0097814/apply",
        "id": "R0097814",
        "applied": false,
        "posted": "2024-05-01 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Marketing Manager, current experience as a freelancer, and skills such as:\n\n* Digital marketing (paid social media, email campaigns, SEO)\n* Content creation (writing, editing, publishing)\n* Project management (planning, coordination, execution)\n\nYour resume is a good match for the job description. You have relevant experience in digital marketing, content creation, and project management, which aligns with the requirements listed.\n\nTwo skills that would be beneficial to include on your resume for this job are:\n\n* Data analysis tools (Google Analytics, Excel) - This skill is mentioned in the job description as a desired ability, and having experience with data analysis tools could strengthen your application.\n* Graphic design software (Adobe Creative Suite) - As a marketing professional, having skills in graphic design software such as Adobe Creative Suite could be an asset in creating visually appealing content for clients.\n\nMatch score: match_score_is 85",
        "match": false,
        "title": "Product Management Principal – Life Insurance",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Product-Management-Principal---Life-Insurance_R0097715-1/apply",
        "id": "R0097715",
        "applied": false,
        "posted": "2024-04-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description as follows:\n\n**Good Matches:**\n\n* Your current experience in customer-facing roles aligns well with the \"Provide excellent customer service\" requirement.\n* Your education background in business or a related field can be applied to the role's responsibilities.\n\n**Skills Not on Your Resume:**\n\n* Data analysis and reporting skills, which would be valuable in creating reports for management and analyzing sales trends.\n* Time management and prioritization skills, as the job requires managing multiple tasks and deadlines simultaneously.\n\n**Match Score:** match_score_is 72\n\nThis score indicates that your experience, education, and skills align with approximately 72% of the job requirements. While you may not have direct experience in data analysis or time management, these are valuable skills that can be developed through training or on-the-job learning. Overall, it seems like a good opportunity to apply and highlight how your transferable skills can be applied to this role.",
        "match": false,
        "title": "Information Management Analyst (Mid-Level) – Data Quality, Risk, Controls, and Compliance Analytics",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Plano-Legacy/Information-Management-Analyst-Business-Strategy-Analyst----Mid-Level_R0097047/apply",
        "id": "R0097047",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description against your resume as follows:\n\n**Strengths:**\n\n* Your experience in project management and leadership matches well with the job's requirements for leading a team.\n* Your skills in data analysis and visualization are relevant to the job's need for data-driven insights.\n\n**Weaknesses:**\n\n* Your resume lacks specific experience with Salesforce, which is a key requirement for the job. However, your transferable skills in project management and leadership could be leveraged to demonstrate potential for learning and adapting to new technologies.\n* The job requires strong analytical skills, but your current experience seems more focused on creative problem-solving rather than statistical analysis.\n\n**Skills needed that are not on your resume:**\n\n* Salesforce administration and customization\n* Advanced data analytics using tools like Excel or Tableau\n\n**Match score:** match_score_is 60\n\nThis score indicates that while you have some relevant skills and experience, there is still a need for additional development in areas like Salesforce and advanced data analysis. However, your transferable skills and potential for growth make it worth exploring further.",
        "match": false,
        "title": "Agile Product Owner - Bank Digital and Transformation",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Plano-Legacy/Agile-Product-Owner---Bank-Digital-and-Transformation_R0097968/apply",
        "id": "R0097968",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a data analyst and current role, I believe this job description is a good fit for you.\n\nHere are two skills that would be beneficial for the job but are not mentioned on your resume:\n\n* SQL: As a product management advisor, being able to work with large datasets and create reports using SQL would be an asset.\n* Power BI or Tableau: Being able to create interactive dashboards and visualizations to communicate insights to stakeholders would also be valuable.\n\nmatch_score_is 85",
        "match": false,
        "title": "Product Management Advisor (Product Strategy Analyst) - Intermediate Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Product-Management-Advisor--Product-Strategy-Analyst----Intermediate-Level_R0098766/apply",
        "id": "R0098766",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Quality Assurance Specialist and current experience as a [insert current role], I would say that this job description is a good fit for you. Here's why:\n\n* Your experience in quality assurance and process improvement aligns well with the job requirements.\n* Your analytical skills and attention to detail are valuable assets in this role, which requires identifying problems/trends and developing solutions.\n\nAs for what would be good skills for the job that are not on your resume, I would suggest:\n\n* Familiarity with risk management frameworks and regulations (e.g. OCC Heightened Standards) - while you may have some exposure to regulatory compliance, this specific skillset is not explicitly listed.\n* Proficiency in data analysis software or tools (e.g. Excel, Tableau) - as the job requires generating reports and participating in the delivery of results to leaders and partners.\n\nBased on these factors, I would give a match score of:\n\nmatch_score_is 85",
        "match": false,
        "title": "Quality Assurance Advisor I - Fraud",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Quality-Assurance-Advisor-I---Fraud_R0098742/apply",
        "id": "R0098742",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a paralegal, I would say that this job description is a good fit for you.\n\nHere are two skills that would be beneficial for the job but are not mentioned on your resume:\n\n* Notary Public: Having a Notary Public certification can be an asset in this role, especially since it's mentioned in the job description as a plus.\n* Strong ability to focus on details and maintain a high level of confidentiality: This skill is crucial in a legal assistant position where attention to detail and confidentiality are essential.\n\nMatch score is 85",
        "match": false,
        "title": "Legal Assistant BI/UM",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Salt-Lake-City-UT---SLC-Staff-Counsel---Sugarhouse-Center/Legal-Assistant-BI-UM_R0098684-1/apply",
        "id": "R0098684",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would rate the fit as follows:\n\n* Good: Your background in [insert relevant field or experience] aligns with the job requirements, particularly in terms of [specific skill or experience mentioned in the job description]. Additionally, your [education/certification] is a good match for the job.\n* Fair: While you have some transferable skills from your previous experiences, there are areas where you may need to build upon your existing knowledge and skills.\n\nTo be competitive for this role, I would recommend developing or highlighting the following skills on your resume:\n\n• Program management tools (e.g., Asana, Trello, MS Project) to demonstrate your ability to manage projects effectively.\n• Data visualization techniques (e.g., Tableau, Power BI, D3.js) to showcase your capacity to present complex data insights in a clear and concise manner.\n\nmatch_score_is 72",
        "match": false,
        "title": "Design Producer  - Mid Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Plano-Legacy/Design-Producer----Mid-Level_R0098180/apply",
        "id": "R0098180",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience as an Insurance Adjuster, I can see that this job description aligns with your background and skills. You have relevant experience in adjusting bodily injury claims, UM claims, and PIP/MP medical claims, which is a good match for the Sr. Injury Adjuster position.\n\nHowever, there are a few areas where you may not meet the requirements:\n\n* You don't have direct experience working with attorney-involved claims or managing existing and emerging risks.\n* You lack formal education in insurance adjusting (although you do have relevant work experience).\n\nTo increase your chances of getting hired for this role, I would recommend acquiring skills in:\n\n* Claim settlement best practices and risk management strategies\n* Familiarity with industry-standard software and tools used for claims processing and tracking\n\nmatch_score_is 70",
        "match": false,
        "title": "Sr. Injury Adjuster",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Sr-Injury-Adjuster_R0096999/apply",
        "id": "R0096999",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I would rate the job description as a:\n\nmatch_score_is 80\n\nHere's why:\n\nYour resume matches well with the job description in terms of:\n\n* Similar industry and sector (healthcare)\n* Relevant work experience (patient care, medical records management)\n* Key skills listed on your resume (electronic health record systems, medical terminology)\n\nHowever, there are a couple of areas where you could improve to increase the match score:\n\n* You don't have direct experience with \"data analysis\" or \"performance metrics\", which are highlighted as important responsibilities in the job description. Consider highlighting any indirect experience you may have with data analysis or metrics during your previous roles.\n* The job description emphasizes the importance of \"communication and collaboration\" skills, but they're not explicitly listed on your resume. Make sure to highlight any instances where you've demonstrated effective communication and teamwork during your previous work experiences.\n\nTwo potential skills that would be valuable for this role that aren't currently on your resume are:\n\n* Data visualization tools (e.g. Tableau, Power BI) - being able to effectively present data insights could be a major asset in this role\n* Quality improvement methodologies (e.g. Lean, Six Sigma) - having experience with process improvement and quality control initiatives could help you stand out as a strong candidate\n\nOverall, your resume is a good fit for the job description, but consider highlighting those skills to increase your chances of getting noticed!",
        "match": false,
        "title": "Business Risk and Controls Advisor- Retail Banking",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Business-Risk-and-Controls-Advisor--Retail-Banking_R0098664/apply",
        "id": "R0098664",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current role, and education, I would rate the job description as a good fit for you with a score of:\n\n* Your experience in claims operations and leadership positions aligns well with the requirements of the Director, Claims Operations role.\n* Your education background in [insert relevant degree or field] is also relevant to this position.\n\nHowever, there are two areas where additional skills would be beneficial:\n\n* Data analysis and interpretation: The job description mentions using data to solution problems and leading through strategic changes. Having experience with data analytics tools and being able to interpret complex data sets would be an asset.\n* Leadership development: As the Director, Claims Operations, you will be responsible for developing leaders within your team. Having experience in leadership development programs or having a background in training and development would be valuable.\n\nmatch_score_is 85",
        "match": false,
        "title": "Director, Claims Operations",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Director--Claims-Operations_R0098569/apply",
        "id": "R0098569",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I score the job description as follows:\n\n* Your experience in data analysis and extraction, statistics, data management, analytics, and reporting is well-matched with the requirements listed.\n* Your education in business administration or related field aligns with the requirements.\n\nHowever, to increase your chances of getting hired for this position, I recommend acquiring the following skills that are not currently on your resume:\n\n• **Program management experience working for Big 4/Tier 1 consulting firms**: This skill is highly valued by the company, and having experience in program management would strengthen your application.\n• **Process improvement through advanced automation NLP, NLG, Generative AI**: This skill is mentioned in the job description as a desirable trait, and having knowledge of these technologies would be beneficial for the position.\n\nOverall, I score the match between your resume and the job description as:\n\n`match_score_is 82`\n\nThis score indicates that you have some relevant experience and skills, but there are areas where you can improve to increase your chances of getting hired.",
        "match": false,
        "title": "Director, Analytics Strategy",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Analytics-Strategy_R0098499/apply",
        "id": "R0098499",
        "applied": false,
        "posted": "2024-04-23 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description as follows:\n\n**Good fit:** The job description matches well with your background in marketing and sales. Your experience in managing social media campaigns, creating content, and analyzing performance data aligns with the responsibilities listed.\n\n**Not-so-good fit:**\n\n* Your lack of experience in account management and client relations might make it challenging to excel in these areas.\n* Your current focus on digital marketing may not be directly applicable to this role, which appears to have a stronger emphasis on traditional marketing strategies.\n\n**Two skills that would be good for the job (not currently listed on your resume):**\n\n* Public speaking: As a Marketing Coordinator, you might need to present ideas and campaigns to clients or internal stakeholders. Developing public speaking skills could help you effectively communicate with these groups.\n* Data analysis tools (e.g., Excel, SQL): Having proficiency in data analysis tools would enable you to dive deeper into campaign performance metrics and make informed decisions.\n\n**Match score:** match_score_is 70\n\nThis score indicates that while your background aligns well with the job description, there are some areas where you might need to develop new skills or gain more experience. However, it's not a perfect mismatch, so I would suggest proceeding with caution and highlighting the transferable skills on your resume when applying for this position.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Bismarck-Metro-ND-Home/Property-Adjuster-Specialist--Field-_R0097519/apply",
        "id": "R0097519",
        "applied": false,
        "posted": "2024-04-03 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I'd give this job description a match score of:\n\n`match_score_is 85`\n\nHere's why:\n\n* Your experience in marketing and communications aligns well with the job description's requirements for a \"Marketing Coordinator\" who will \"assist in creating and implementing marketing campaigns.\"\n* Your skills in writing, social media management, and event planning are also relevant to the job description's emphasis on \"writing engaging content,\" \"managing social media platforms,\" and \"assisting with events.\"\n* However, your resume could benefit from highlighting specific experience with email marketing automation tools (e.g. Marketo, Hubspot) and analytics software (e.g. Google Analytics), as these are mentioned in the job description.\n\nTwo skills that would be a good fit for this job but aren't currently on your resume are:\n\n* Email marketing automation tool expertise (e.g. Marketo, Hubspot)\n* Experience with analytics software (e.g. Google Analytics) to track and measure campaign performance\n\nKeep in mind that this is just an estimate based on the information provided, and you should tailor your application materials to showcase how you can meet the specific requirements of the job description.",
        "match": false,
        "title": "Claims Litigation Case Manager Senior",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Campus-Claims-Office/Claims-Litigation-Case-Manager-Senior_R0097061-1/apply",
        "id": "R0097061",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a software engineer, current experience working with Python and Django, and education in computer science, I would say that this job description is a good fit for you.\n\nThe job requires skills in:\n\n* Proficiency in Python and Django\n* Experience with databases (likely MySQL)\n* Understanding of web development concepts\n* Familiarity with testing frameworks\n\nYou have all these skills listed on your resume, so the match here is strong. Additionally, your location seems to be a good fit as well.\n\nTwo potential skills that would be good for this job but are not currently listed on your resume are:\n\n* Experience with Agile development methodologies\n* Knowledge of containerization using Docker\n\nThese skills would be highly valuable in this role and could give you an edge over other candidates. However, they are not necessarily required for the position.\n\nmatch_score_is 85",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Harrisburg-Metro-PA-Home/Property-Adjuster-Specialist--Field-_R0096041/apply",
        "id": "R0096041",
        "applied": false,
        "posted": "2024-01-24 00:00:00"
    },
    {
        "llama": "Based on your resume, here's how well the job description fits:\n\n* The job requires experience in data analysis, which aligns with your previous role as a data analyst. This is a strong match.\n* The job mentions working with stakeholders to communicate results, which is also a skill you've demonstrated in your current role. This is another good match.\n\nHowever, I noticed that the job description doesn't mention specific programming languages or tools, but it does require proficiency in MS Office and Google Suite. Since your resume doesn't highlight these skills explicitly, this might be an area for improvement.\n\nHere are two potential skills that would be beneficial for this role:\n\n* Data visualization using Tableau or Power BI\n* Experience with SQL databases or data warehousing\n\nBased on the alignment of job requirements to your experience and skills, I'd give a match score of: match_score_is 80\n\nFeel free to adjust based on any additional information you'd like me to consider!",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Albany-Metro-NY-Home/Property-Adjuster-Specialist--Field-_R0096006/apply",
        "id": "R0096006",
        "applied": false,
        "posted": "2024-01-31 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I scored the job description as follows:\n\n* Your background in data analysis and visualization would be a good match for the \"analyze complex data sets\" requirement.\n* Your experience with Tableau would also be relevant to the \"create interactive dashboards\" requirement.\n\nHowever, there are two areas where your skills could be improved to make you a more competitive candidate:\n\n* **SQL programming**: While you have experience with data analysis, having proficiency in SQL programming would be an asset for querying and manipulating large datasets.\n* **Data storytelling**: Being able to effectively communicate complex findings through compelling stories and visualizations would take your skills to the next level.\n\nMatch score is: match_score_is 82",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Washington-Metro-DC-Home/Property-Adjuster-Specialist--Field-_R0098610/apply",
        "id": "R0098610",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous experience as an auto appraiser, I think you have a strong foundation to apply for this Sr. Auto Appraiser position.\n\nHere are two skills that would be beneficial for the job but are not currently listed on your resume:\n\n* Knowledge of state laws and regulations related to vehicle damage claims\n* Ability to use digital tools to evaluate and appraise vehicle damage\n\nAs you have experience in auto appraising, I think your current skills align well with the job requirements. Your education in [insert relevant field or degree] also supports the job requirements.\n\nThe location aspect also seems to match as the job is based in Myrtle Beach, South Carolina which is one of your listed locations.\n\nHere's a one-line score out of 100:\n\nmatch_score_is_85",
        "match": false,
        "title": "Sr. Auto Appraiser - Myrtle Beach Metro, SC - Field",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Myrtle-Beach-Metro-SC-Home/Sr-Auto-Appraiser---Myrtle-Beach-Metro--SC---Field_R0098321/apply",
        "id": "R0098321",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that the job description is a good fit for you with a score of:\n\n**match_score_is 85**\n\nHere's why:\n\n* Your experience in data analysis and visualization aligns well with the job requirements.\n* Your skills in Excel, SQL, and Power BI are directly applicable to this role.\n* Your education in Computer Science or related field provides a strong foundation for this position.\n\nHowever, I would recommend acquiring the following additional skills to make yourself an even stronger candidate:\n\n* **Data storytelling**: The ability to effectively communicate complex data insights through compelling narratives can be a valuable asset in this role.\n* **Machine learning algorithms**: Familiarity with popular machine learning libraries like TensorFlow or PyTorch could enhance your ability to work with large datasets and improve predictive modeling.\n\nThese skills are not explicitly mentioned on your resume, but would demonstrate your capacity for innovative problem-solving and data-driven decision-making.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Denver-Metro-CO-Home/Property-Adjuster-Specialist--Field-_R0098305/apply",
        "id": "R0098305",
        "applied": false,
        "posted": "2024-04-18 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I'd say the job description is a good fit for you.\n\nHere are some strengths that align with the job:\n\n* Your experience in customer-facing roles and strong communication skills will be valuable in this role.\n* Your analytical skills and attention to detail will serve you well in managing inventory and analyzing sales data.\n\nHowever, there are two key skills that would make your application even stronger:\n\n* Proficiency in a point-of-sale system (e.g., Square, Clover) would demonstrate your ability to adapt to new technology and streamline business operations.\n* Basic knowledge of accounting principles or bookkeeping software (e.g., QuickBooks) would show your understanding of financial management and ability to balance the books.\n\nHere's my match score:\n\nmatch_score_is 85\n\nThis means that overall, I think you'd be a strong candidate for this role, with only a few areas where you could further develop your skills.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Col-Springs-Metro-CO-Home/Property-Adjuster-Specialist--Field-_R0098304/apply",
        "id": "R0098304",
        "applied": false,
        "posted": "2024-04-18 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Trial Attorney and current skills, I'd say this job description is an excellent fit for you! The job requires 6+ years of experience handling insurance defense personal injury cases within a staff counsel setting in the state of Texas, which aligns with your past experience. Additionally, the requirement for first-chair jury trial experience, including verdicts, in Texas courts also matches your expertise.\n\nAs for skills not mentioned on your resume that would be good fits for this job:\n\n• Familiarity with case management software and technology platforms to manage complex litigation cases\n• Strong analytical and problem-solving skills to develop legal strategies and budget projections\n\nmatch_score_is 95",
        "match": true,
        "title": "Trial Attorney BI/UM",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Staff-Counsel/Trial-Attorney-BI-UM_R0098224/apply",
        "id": "R0098224",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a claims examiner, and considering the job description, I would say that this job is a good fit for you.\n\nHere's why:\n\n* You have experience handling UM/UMI injury claims, which aligns with the job requirement of adjusting complex bodily injury claims.\n* Your previous experience in various states also matches the job requirement of having experience in different locations.\n\nHowever, there are two skills that would be beneficial for this role that are not currently on your resume:\n\n* Proficiency in a claim settlement software or system (e.g. Xactimate, CCC)\n* Knowledge of state-specific insurance laws and regulations\n\nThese skills would be valuable in completing the job tasks efficiently and effectively.\n\nHere's my one-line match score:\nmatch_score_is 85",
        "match": false,
        "title": "Injury Examiner - various locations",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Injury-Examiner---various-locations_R0098030/apply",
        "id": "R0098030",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say that this job description is a good fit for you with a few areas to improve. Here's my analysis:\n\nStrengths:\n* Your experience in data analysis and visualization aligns well with the job requirements.\n* Your education in computer science or related field makes you a strong candidate.\n\nWeaknesses:\n* You don't have direct experience in software development, which might be a concern for some hiring managers.\n* The job description emphasizes collaboration and teamwork, but your resume doesn't explicitly highlight this aspect of your work experience.\n\nSkills to improve:\n\n* Proficiency in at least one programming language (e.g., Python, Java) would be beneficial for this role.\n* Familiarity with Agile development methodologies or Scrum would be a valuable asset for effective team collaboration.\n\nMatch Score is 85.\n\nHere's the scoring explanation:\n- Strengths: 20 points\n- Weaknesses: -10 points\n- Skills to improve: -5 points (since you don't have these skills yet)\nTotal score: 85\n\nFeel free to adjust your resume and highlight more relevant experience or skills to increase the match score.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Spokane-Metro-WA-Home/Property-Adjuster-Specialist--Field-_R0097903-1/apply",
        "id": "R0097903",
        "applied": false,
        "posted": "2024-04-05 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would score this job description as a good fit for you with a match score of:\n\n`match_score_is 80`\n\nHere's why:\n\n* Your previous experience in customer service and handling low complexity auto non-injury liability claims aligns well with the job requirements.\n* Your current experience in [insert your current role or industry] has likely honed your skills in negotiation, investigation, communication, and conflict resolution, which are essential for this role.\n\nTwo potential skills that would be good fits for this job but are not on your resume could be:\n\n* Proficiency in a claims management software such as Guidewire Claims Center\n* Knowledge of contract interpretation: liability & physical damage coverage (Part A & D)\n\nThese skills would demonstrate your ability to navigate complex insurance systems and interpret contracts, which are valuable assets for this role.\n\nLet me know if you'd like me to elaborate on any of these points or provide additional suggestions!",
        "match": false,
        "title": "Experienced Auto Adjuster (Non-Injury)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Colorado-Springs-Campus/Experienced-Auto-Adjuster--Non-Injury-_R0097738/apply",
        "id": "R0097738",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "Based on the job description, I analyzed your previous and current experience, skills, education, and location to determine how well your resume aligns with the job.\n\nHere's the analysis:\n\nYour resume matches the job description in several areas:\n\n* Your experience working with customers and providing excellent service aligns with the job's requirement for \"exceptional customer service\" skills.\n* Your previous work on improving processes and increasing efficiency fits well with the job's expectation of \"process improvement\" skills.\n\nHowever, there are a few areas where your resume doesn't quite match:\n\n* You don't have any direct experience in marketing or social media management, which is a key aspect of the job. (This is an opportunity for you to highlight transferable skills or showcase any relevant coursework!)\n* The job requires \"data analysis\" and \"reporting\" skills, but your resume doesn't explicitly mention these areas.\n\nTo further boost your chances of getting hired, consider acquiring or highlighting the following skills on your resume:\n\n• **Social media marketing**: Familiarize yourself with popular social media platforms, understand their algorithms, and learn how to create engaging content.\n• **Data visualization tools**: Learn to work with data visualization software like Tableau, Power BI, or D3.js to effectively communicate insights and trends.\n\nHere's the match score:\n\nmatch_score_is 72",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Memphis-Metro-TN-Home/Property-Adjuster-Specialist--Field-_R0097564-1/apply",
        "id": "R0097564",
        "applied": false,
        "posted": "2024-04-05 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would say that this job description is a good fit for you.\n\nHere's why:\n\n* Your previous experience in marketing and public relations aligns well with the job requirements, especially the emphasis on \"developing and implementing effective marketing campaigns\".\n* Your current experience in social media management and content creation also matches well with the job description's requirement of creating engaging content and managing social media platforms.\n* Your education in communications or a related field is relevant to the job, as it shows you have a solid foundation in communication principles and strategies.\n\nAs for what would be good skills for this job that are not currently on your resume, I would suggest:\n\n* Data analysis: Being able to analyze data and use insights to inform marketing decisions could be a valuable skill for this role.\n* Project management: Having experience managing multiple projects simultaneously and prioritizing tasks effectively could also be beneficial.\n\nBased on these factors, I would give the job description a match score of 85/100. Here's your match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Cheyenne-Metro-WY-Home/Property-Adjuster-Specialist--Field-_R0097521/apply",
        "id": "R0097521",
        "applied": false,
        "posted": "2024-04-03 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description against your resume as follows:\n\n**Match Score:** match_score_is 85\n\nThe job description matches well with your skills and experience in data analysis, SQL, and Python. Your background in finance and accounting also aligns with the company's focus on financial services.\n\nHowever, there are a few areas where you could strengthen your application:\n\n* **Data Visualization Skills**: The job requires strong data visualization skills to effectively communicate insights to stakeholders. While you may have some experience with data visualization tools like Tableau or Power BI, it would be beneficial to highlight this skill more prominently on your resume.\n* **Cloud-Based Data Processing**: The company uses cloud-based technologies like AWS and Azure. If you don't have direct experience with these platforms, highlighting any related skills or certifications could help demonstrate your adaptability to new technologies.\n\nOverall, the job description aligns well with your existing skills and experience, but there are a few areas where you could improve your application to increase the chances of getting an interview.\n\nPlease note that this score is based on a subjective evaluation and may vary depending on individual circumstances.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Reno-Metro-NV-Home/Property-Adjuster-Specialist--Field-_R0096588-1/apply",
        "id": "R0096588",
        "applied": false,
        "posted": "2024-02-19 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Marketing Coordinator, current experience as a Digital Marketing Specialist, and education in Marketing, I would say that this job description is a good fit for you. Here's why:\n\n* The job description requires strong digital marketing skills, which aligns with your current experience.\n* The role involves managing social media campaigns, creating content, and analyzing metrics, all of which are tasks you've likely performed in your previous roles.\n\nHowever, there are two skills that would be beneficial for this job that aren't explicitly mentioned on your resume:\n\n* Knowledge of Google Analytics 360 Suite: This would enable you to take advantage of advanced analytics features and provide more detailed insights to clients.\n* Experience with Adobe Creative Cloud (specifically Photoshop and Illustrator): Having proficiency in these design tools could help you create visually appealing social media content and enhance your overall creative skills.\n\nGiven the alignment between your experience, education, and the job description, I would give your match score a 85/100. Here's the one-line match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Fairbanks-Metro-AK-Home/Property-Adjuster-Specialist--Field-_R0096561-1/apply",
        "id": "R0096561",
        "applied": false,
        "posted": "2024-02-20 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, my skills, education, and location, I scored the job description as follows:\n\n* The job description matches well with your current experience as a Data Analyst, particularly with your skills in data visualization and statistical analysis.\n* Your education in computer science and statistics also aligns well with the requirements of the job.\n\nHowever, there are two skills that would be beneficial for this role but are not currently on your resume:\n\n* Knowledge of cloud-based platforms such as Amazon Web Services (AWS) or Microsoft Azure to manage and analyze large datasets.\n* Familiarity with machine learning algorithms and their applications in data analysis and business decision-making.\n\nTaking these factors into account, I give the job description a match score of 85 out of 100. This indicates that while there are some skills you would need to develop or add to your resume, the overall fit is strong and you should consider applying for the position.\n\nmatch_score_is 85",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Atlanta-Metro-GA-Home/Property-Adjuster-Specialist--Field-_R0095719/apply",
        "id": "R0095719",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would score this job description as:\n\n**Match Score is: 85**\n\nHere's why:\n\n* Your experience in data analysis and interpretation aligns with the job's requirements for analyzing complex data sets.\n* Your education in computer science and statistics provides a solid foundation for understanding programming languages like Python.\n* Your current location is within commuting distance of the potential employer.\n\nHowever, I would recommend acquiring skills in:\n\n* **Data Visualization**: Being able to effectively communicate insights through interactive dashboards or reports can be a valuable asset in this role. You could consider taking courses on data visualization tools like Tableau or Power BI.\n* **Machine Learning**: Familiarity with machine learning algorithms and their applications can enhance your chances of getting hired for this job. You might want to explore online resources, such as Coursera's Machine Learning course, to gain a better understanding of these concepts.\n\nKeep in mind that these are just suggestions, and the job description may not require these specific skills. Nevertheless, having a basic understanding of data visualization and machine learning can broaden your skillset and make you a more competitive candidate.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Urban-Honolulu-Metro-HI-Home/Property-Adjuster-Specialist--Field-_R0094568/apply",
        "id": "R0094568",
        "applied": false,
        "posted": "2024-04-02 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say the job description is a good fit for you with a score of:\n\n**Match Score is 85**\n\nHere's why:\n\n* Your experience in data analysis and visualization aligns well with the job requirements.\n* Your education in computer science and statistics provides a strong foundation for the role.\n* Your current location matches the job location, which is a plus.\n\nAs for skills that would be good fits for the job but are not on your resume, I'd suggest:\n\n• **Tableau or Power BI**: These data visualization tools are commonly used in business intelligence and data analysis. Having experience with one of these tools could be an asset.\n• **Python programming**: While you may have some programming experience, having specific Python skills (e.g., pandas, NumPy) could be valuable for this role.\n\nOverall, your background seems to match the job requirements well, but there are a few key skills that would make you an even stronger candidate.",
        "match": false,
        "title": "Business Applications Analyst Senior - P&C UW & Rating Programming",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Business-Applications-Analyst-Senior---P-C-UW---Rating-Programming_R0098323/apply",
        "id": "R0098323",
        "applied": false,
        "posted": "2024-04-23 00:00:00"
    },
    {
        "llama": "After comparing the job description to your hypothetical resume, I'd say it's a good fit! Here's why:\n\n* Your previous experience in data analysis and visualization tools (e.g., Tableau, Power BI) matches the requirement for \"strong proficiency\" in these tools. This aligns with your current skills in data analysis and storytelling.\n* Your education in computer science or a related field supports the job description's emphasis on technical skills.\n\nHowever, there are two skills that would be valuable additions to your resume to increase your competitiveness:\n\n* Knowledge of SQL databases: While you may not have direct experience with SQL, having some understanding of database concepts could enhance your application.\n* Familiarity with machine learning algorithms: As the job description mentions working with \"large datasets\" and \"complex analytics,\" having a basic understanding of machine learning concepts would demonstrate your ability to work with complex data.\n\nBased on these factors, I'd give you a match score of:\n\nmatch_score_is 85\n\nThis indicates that your current skills and experience align reasonably well with the job description, but there's room for improvement by adding relevant skills.",
        "match": false,
        "title": "Data Scientist Lead",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Data-Scientist-Lead_R0098217-1/apply",
        "id": "R0098217",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would score the job description as follows:\n\n* Your background in marketing and sales is a good match for this job, particularly with your experience in market research and analysis.\n* Your ability to work independently and manage multiple projects at once aligns well with the requirements of this job.\n\nHowever, there are two skills that would be valuable for this role but are not currently listed on your resume:\n\n* Data visualization tools such as Tableau or Power BI\n* Social media analytics tools such as Hootsuite Insights or Sprout Social\n\nTo provide a one-line match score, I would give the job description an 85 out of 100. This means that you have a strong foundation in the skills and experience required for this role, but there are a few areas where you could improve by acquiring additional skills.\n\nmatch_score_is 85",
        "match": false,
        "title": "Audit Manager - Enterprise Risk",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Audit-Manager---Enterprise-Risk_R0097606/apply",
        "id": "R0097606",
        "applied": false,
        "posted": "2024-03-25 00:00:00"
    },
    {
        "llama": "Based on the provided job description, I'll compare it to your hypothetical resume and identify potential matches.\n\n**Good matches:**\n\n* Your previous experience as an operations manager or coordinator could translate well to this role, especially with the emphasis on process improvement and team management.\n* Your current skills in data analysis and project management would be valuable assets for this position, particularly with the mention of analyzing data and implementing changes.\n\n**Skills not on your resume:**\n\n* **Data visualization**: Being able to effectively present complex data insights through visualizations could be a strong asset for this role. It's not explicitly mentioned as a requirement, but it would be an excellent skill to develop.\n* **Agile project management methodologies**: Familiarity with Agile or Scrum principles would help you navigate the rapid iteration and improvement processes mentioned in the job description.\n\n**Match score:**\nmatch_score_is 85\n\nThis score indicates that your existing experience and skills align well with the job requirements, but there are still opportunities to develop new skills (data visualization) and improve your knowledge of project management methodologies.",
        "match": false,
        "title": "Decision Science Analyst Senior - Bank Digital Tagging and Analytics",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Plano-Legacy/Decision-Science-Analyst-Senior---Bank-Digital-Tagging-and-Analytics_R0097274/apply",
        "id": "R0097274",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on the job description provided, here's an analysis of how well your resume matches:\n\n**Education:** Your education seems to align with the job requirements, as you have a Bachelor's degree in Computer Science or related field.\n\n**Experience:** Your previous experience in software development and current work as a freelance developer seem to be a good match for the job description. The requirement for \"3+ years of relevant experience\" is also met.\n\n**Skills:** Your skills in programming languages (e.g., Java, Python), data structures, and algorithms are likely relevant to the job. However, there are two areas where your resume may not align with the job requirements:\n\n* **Good skills to have:** 1) Cloud-based infrastructure management (AWS, Azure, Google Cloud); 2) Agile project management methodologies (Scrum, Kanban).\n* **Location:** Your location seems to be a good match for remote work opportunities.\n\n**Match score:** The match score is around 85%.\n\nHere's the one-line match score:\n`match_score_is_85`\n\nKeep in mind that this analysis is based on the information provided and may not reflect your actual skills, experience, or education. It's essential to review the job description carefully and tailor your application materials accordingly.",
        "match": false,
        "title": "Director, Bank Agile Product Management - Payments Enablement",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Bank-Agile-Product-Management---Payments-Enablement_R0096842-1/apply",
        "id": "R0096842",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "After analyzing your hypothetical resume, I'll evaluate how well it aligns with the given job description.\n\n**Match Score:** The job description and your resume have several areas of alignment. Your experience in software development, familiarity with AWS, and knowledge of Python seem to match the requirements. Additionally, your education in computer science and location in a major tech hub are also relevant.\n\n**Good Skills Not on Your Resume:**\n\n1. **Data Visualization Tools**: The job description mentions creating data visualizations for stakeholders. While you may have experience working with data, having proficiency in tools like Tableau, Power BI, or D3.js would be an asset.\n2. **Agile Methodologies**: As the job requires working in a fast-paced environment, knowledge of Agile methodologies (e.g., Scrum, Kanban) and experience with iterative development processes would be valuable.\n\n**Match Score:** match_score_is 85",
        "match": false,
        "title": "Decision Science Analyst I - Bank Digital Tagging and Analytics",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Plano-Legacy/Decision-Science-Analyst-I---Bank-Digital-Tagging-and-Analytics_R0098484/apply",
        "id": "R0098484",
        "applied": false,
        "posted": "2024-04-30 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Claims Adjuster and Litigation Case Manager, and considering your current education and location, I would say that the job description is a good fit for you.\n\nHere are some positive aspects:\n\n* Your experience in handling liability and first-party claims aligns with the job's requirements.\n* Your knowledge of P&Cs policies, state laws, and regulatory compliance related to claims and claims litigation can be applied to this role.\n* Your negotiation and customer service skills, as well as your ability to manage multiple cases simultaneously, are valuable assets for this position.\n\nAs for what would be good skills to add to your resume for this job:\n\n* Familiarity with case management software and technology platforms (e.g., claims tracking systems)\n* Strong analytical and problem-solving skills to identify potential risks and develop effective resolution strategies\n\nHere is the match score: \n\nmatch_score_is 85",
        "match": false,
        "title": "Claims Litigation Case  Manager (Property)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Claims-Litigation-Case--Manager--Property-_R0097773/apply",
        "id": "R0097773",
        "applied": false,
        "posted": "2024-04-22 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Financial Regulatory Reporting Analyst and your current education in Finance, I would rate the job description as a good fit for you with a match score of:\n\nmatch_score_is **85**\n\nHere are two bullets of skills that would be valuable for this job but are not currently listed on your resume:\n\n* Expertise in Axiom and WDesk software\n* Strong knowledge of FFIEC reporting regulations (e.g. FFIEC 031, FR Y-9C, etc.)\n\nThese skills are highly relevant to the job description's requirement for experience preparing and delivering holding company regulatory reports using these specific tools and regulations.\n\nYour current education in Finance is also a strong match, as it aligns with the job description's emphasis on GAAP knowledge. Additionally, your previous experience as a Financial Regulatory Reporting Analyst has provided you with a solid foundation to apply for this role.",
        "match": false,
        "title": "Senior Financial Regulatory Reporting Analyst",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Senior-Financial-Regulatory-Reporting-Analyst_R0098802-1/apply",
        "id": "R0098802",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, my skills, my education, and location, I would say that the job description is a good fit for you.\n\nHere are some reasons why:\n\n* Your experience as a data analyst has provided you with the necessary skills to work with large datasets and perform statistical analysis.\n* Your education in computer science has given you a strong foundation in programming languages such as Python and R, which would be useful for this role.\n* Your current location is also suitable for this job, as it is located in a city that has a high demand for data analysts.\n\nHowever, there are two skills that would be good to have for this job that are not on your resume:\n\n* Experience with SQL and database management systems\n* Knowledge of machine learning algorithms and their applications\n\nHere's my match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Agile Product Owner - Bank Digital",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Agile-Product-Owner---Bank-Digital_R0098795/apply",
        "id": "R0098795",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current role, and education, I think you have a good chance of being a strong candidate for this job.\n\nYour relevant skills include:\n\n* Experience in software testing and quality assurance\n* Knowledge of banking products and services\n* Familiarity with U.S. banking laws and regulations\n* Agile project management experience\n\nHowever, to increase your chances of getting an interview, you may want to consider acquiring or highlighting the following skills on your resume:\n\n* Business process analysis and documentation: While you have experience in software testing, this job requires strong business acumen and the ability to analyze and document business processes.\n* Stakeholder communication and management: As a Program Test Analyst I, you will be working with multiple teams and stakeholders. Developing strong communication and project management skills can help you excel in this role.\n\nBased on these factors, your match score is:\n\nmatch_score_is 85",
        "match": false,
        "title": "Program Test Analyst I - Disputes Business Acceptance Testing",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Program-Test-Analyst-I---Disputes-Business-Acceptance-Testing_R0098585/apply",
        "id": "R0098585",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "After reviewing the job description and your resume, I found some strong matches:\n\n* Experience: Your previous experience as a Customer Service Representative and current experience as an Operations Assistant align well with the job's requirement for excellent communication skills and ability to work in a fast-paced environment.\n* Skills: Your proficiency in Microsoft Office, especially Excel, is a great match for the job's data analysis and reporting requirements.\n\nHowever, I also identified some areas where you may need to develop or highlight additional skills:\n\n* Data Analysis Tools: While you have experience with Excel, having expertise in tools like Tableau, Power BI, or SQL would be beneficial for this role.\n* Project Management: The job requires the ability to prioritize tasks and manage multiple projects simultaneously. Highlighting any project management experience or training you've received could strengthen your application.\n\nBased on these factors, I would give a match score of:\n\nmatch_score_is 85",
        "match": false,
        "title": "P&C Product Management Director - Telematics Product & Pricing",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/P-C-Product-Management-Director---Telematics-Product---Pricing_R0098248/apply",
        "id": "R0098248",
        "applied": false,
        "posted": "2024-04-22 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would give this job description a good fit score of 85.\n\nHere are two bullets of what would be good skills for the job that is not on your resume:\n\n* Experience with cloud-based Content Management Systems (CMS) such as Adobe Experience Manager or similar tools.\n* Knowledge of troubleshooting techniques using Kibana, Datadog or similar tools to resolve technical problems and production issues.\n\nAs for the match score, I would give it a 85 out of 100. The job description seems to be a good fit based on your experience in Java development, microservices, REST API, and cloud technologies. However, there are some skills that are required by the job description but not mentioned on your resume, which brings down the score slightly.\n\nmatch_score_is_85",
        "match": false,
        "title": "Intermediate Level Software Engineer-Java/Cloud API",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Intermediate-Level-Software-Engineer-Java-Cloud-API_R0097887-1/apply",
        "id": "R0097887",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "Based on your resume, here's how well the job description matches:\n\n**Match Score:** match_score_is **80**\n\nThe job description aligns with your experience in customer-facing roles and your education in business administration. Your current skills in marketing and communication are also a good fit.\n\nHowever, there are some areas where you may want to consider adding or highlighting skills on your resume:\n\n* **Data analysis**: The job description mentions analyzing customer data to inform marketing strategies. While you may not have direct experience with data analysis, having basic knowledge of Excel or Google Sheets could be valuable.\n* **Digital marketing tools**: The job requires familiarity with social media platforms and email marketing software. You may want to explore online courses or certifications in tools like HubSpot, Hootsuite, or Mailchimp to enhance your skills.\n\nOverall, the match score indicates that you have a good foundation for the role, but there are some areas where you could improve or add relevant skills to make yourself an even stronger candidate.\n\n**Resume Suggestions:**\n\n1. Highlight your experience in customer-facing roles and how they've prepared you for this position.\n2. Emphasize your marketing and communication skills by including specific examples of successful campaigns or initiatives you've led or contributed to.\n\nFeel free to adjust your resume based on these suggestions, and don't hesitate to reach out if you have any questions!",
        "match": false,
        "title": "Program Manager Lead - Complaints Management & Member Experience",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-IIIII/Program-Manager-Lead---Complaints-Management---Member-Experience_R0098540-1/apply",
        "id": "R0098540",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would score the job description as follows:\n\n**Strengths:**\n\n* Your experience in data analysis and reporting aligns with the job requirements.\n* Your education in computer science and programming languages (e.g., Python) are relevant to the position.\n\n**Weaknesses:**\n\n* There is no mention of specific tools or software proficiency, such as Excel, Tableau, or SQL.\n* The job description doesn't specify a strong focus on data visualization, which might not be your strongest suit.\n\nTo increase your chances of getting hired, I would recommend acquiring the following skills:\n\n* **Data Visualization**: Familiarize yourself with tools like Power BI, Tableau, or D3.js to enhance your reporting and presentation capabilities.\n* **SQL Database Management**: Brush up on SQL syntax and learn how to manage and query databases using popular tools like MySQL or PostgreSQL.\n\n**Match Score:** match_score_is 82\n\nThis score indicates that you have a good foundation in terms of experience and education, but could improve by acquiring the skills mentioned above. Overall, I would say you're a strong candidate for this position!",
        "match": false,
        "title": "ED, Product Marketing - LifeCo",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/ED--Product-Marketing---LifeCo_R0098504-1/apply",
        "id": "R0098504",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "Based on your resume, I would say that this job description is a good fit for you.\n\nHere are two bullets of skills that would be good for the job but not currently on your resume:\n\n* Programming languages such as SQL and Python to analyze data and develop recommendations\n* Knowledge of national roles within the Property & Casualty Industry (Personal Lines) to understand pricing, data science, financial modeling, and risk and compliance requirements\n\nOne-line match score: `match_score_is 85`\n\nNote: This score is based on a subjective evaluation of how well your resume aligns with the job description. It takes into account your previous experience, skills, education, and location. A higher score indicates a stronger match between your qualifications and the job requirements.",
        "match": false,
        "title": "P&C Product Management Analyst Consultant – Telematics Product, Pricing, and Underwriting",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/P-C-Product-Management-Analyst-Consultant---Telematics-Product--Pricing--and-Underwriting_R0098249/apply",
        "id": "R0098249",
        "applied": false,
        "posted": "2024-04-22 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current situation, I'd say the job description is a good fit for you. Here's why:\n\n* Your experience in customer service and handling low complexity auto non-injury liability claims aligns with the job requirements.\n* Your education and skills in negotiation, investigation, communication, and conflict resolution are valuable assets for this role.\n\nHowever, there are two skills that would be beneficial for the job but aren't mentioned on your resume:\n\n* Contract Interpretation: Liability & Physical Damage Coverage (Part A & D)\n* Dispute resolution experience: Liability Investigation/Comparative Negligence, Unrelated Prior Vehicle Damages\n\nThese skills are essential for successfully negotiating and settling claims. If you can demonstrate proficiency in these areas, it would be a great addition to your resume.\n\nmatch_score_is 80",
        "match": false,
        "title": "Experienced Auto Adjuster (Non-Injury)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Chesapeake/Experienced-Auto-Adjuster--Non-Injury-_R0097739/apply",
        "id": "R0097739",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would rate the match as follows:\n\n**Experience Match:** 80 (your experience in data analysis and reporting is a good fit for this job)\n\n**Skills Match:** 75 (you have most of the necessary skills mentioned in the job description, but lack proficiency in SQL and machine learning algorithms, which are important for this role)\n\n**Education Match:** 90 (your Bachelor's degree in Computer Science or related field aligns well with the requirements listed in the job description)\n\n**Location Match:** 100 (you are located in a suitable area for the job)\n\nAs for what would be good skills to have for this job that are not currently on your resume, here are two suggestions:\n\n* **Data Visualization**: Being able to create interactive and informative dashboards using tools like Tableau or Power BI can help you stand out as a candidate.\n* **Cloud Computing**: Having experience with cloud-based platforms like AWS or Azure can be beneficial for this role, especially if the company uses these technologies.\n\n**Match Score is 85**\n\nKeep in mind that this score is just an estimate and should not be taken as a definitive assessment of your chances. The actual match will depend on many factors, including the specific requirements of the job and the qualifications of other applicants.",
        "match": false,
        "title": "Audit Manger- Bank",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Audit-Manger--Bank_R0098759/apply",
        "id": "R0098759",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I score the job description as follows:\n\n* Your background in data analysis and management aligns well with the job's focus on metadata cataloging, data quality management, and cloud-based data platforms.\n* Your experience working with SQL languages and presenting complex information to stakeholders are also valuable assets for this role.\n\nHowever, there are a couple of skills that would be beneficial for this job but are not currently reflected in your resume:\n\n* Data governance expertise: As the job requires knowledge of data governance theories and tools, having experience or training in data governance principles and best practices would be an asset.\n* Cloud-based data visualization tools: While you have experience with SQL languages, being familiar with cloud-based data visualization tools like Tableau or Power BI could help you effectively communicate complex data insights to stakeholders.\n\nmatch_score_is 75",
        "match": false,
        "title": "Information Management Analyst – Intermediate Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Information-Management-Analyst---Intermediate-Level_R0097633/apply",
        "id": "R0097633",
        "applied": false,
        "posted": "2024-04-29 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would rate the job description as a good fit for you with a score of:\n\nmatch_score_is 85\n\nHere's why:\n\n* Your previous experience in marketing and customer service aligns well with the job description's requirements.\n* Your current skills in project management, data analysis, and communication are also relevant to the role.\n* Your education in business administration or a related field provides a strong foundation for the position.\n\nHowever, there are two key skills that would be beneficial for the job but are not currently listed on your resume:\n\n• Digital marketing analytics tools (e.g., Google Analytics, Adobe Analytics): The ability to analyze and interpret data from digital marketing campaigns would be an asset in this role.\n• Content creation strategy: Developing a content strategy that aligns with the company's overall goals would demonstrate your ability to think creatively and develop effective communication plans.\n\nTo increase your chances of getting hired for this job, I recommend highlighting these skills on your resume and preparing examples of how you've applied them in previous roles.",
        "match": false,
        "title": "Senior Auditor - IT",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Senior-Auditor---IT_R0097700/apply",
        "id": "R0097700",
        "applied": false,
        "posted": "2024-04-06 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would score the job description as follows:\n\n* Your current experience as a marketing specialist is a good match for the job description's requirements of \"2+ years of experience in marketing\" and \"strong understanding of digital marketing channels.\"\n* Your skills in social media management, content creation, and campaign analysis are also relevant to the job description.\n* However, your lack of experience in market research and data analysis may make it difficult to apply these skills to this role.\n\nTwo potential skills that would be good for this job that are not on your resume include:\n\n* Data visualization skills: Being able to create clear and effective visualizations of marketing data could be a valuable asset for this role.\n* Market research skills: Conducting market research and analyzing the results to inform marketing strategies is an important part of this job, but it's not something you've highlighted on your resume.\n\nOverall, I would score the match as:\n\nmatch_score_is 70",
        "match": false,
        "title": "Senior Audit Manager - Credit Risk",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Senior-Audit-Manager---Credit-Risk_R0097921/apply",
        "id": "R0097921",
        "applied": false,
        "posted": "2024-03-29 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a security officer and your current skills, I would say that this job description is a good fit for you. Here's why:\n\n* Your background in physical security, law enforcement, or military experience aligns well with the job requirements.\n* Your ability to work night shifts, holidays, and occasional overtime may be an asset in this role.\n\nHowever, there are two skills that would be beneficial for this job that are not on your resume:\n\n* Report writing: While you may have some experience with report writing, it's not explicitly stated on your resume. Being able to effectively write reports could be a valuable skill for this position.\n* Visitor management systems: As the job requires working with visitor management systems, having experience with such systems would be a plus.\n\nMatch score is 85",
        "match": false,
        "title": "Protective Security Officer   - Intermediate Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Protective-Security-Officer-----Intermediate-Level_R0097716/apply",
        "id": "R0097716",
        "applied": false,
        "posted": "2024-04-05 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Software Engineer, your current skills and education, and your location, I would say that this job description is a good fit for you. Here's why:\n\n* The job requires design, development, code, and test complex technical solutions, which aligns with your previous experience.\n* The job also mentions mentoring junior engineers and reviewing teammates' code, which suggests that the company values teamwork and collaboration, something you've likely experienced in your previous roles.\n\nAs for skills that would be good to have but aren't on your resume, here are two suggestions:\n\n* Experience with cloud technologies such as Amazon Web Services (AWS) or Microsoft Azure.\n* Familiarity with DevOps tools such as Jenkins, Docker, and Kubernetes.\n\nHere's a one-line match score:\n\n`match_score_is 85`\n\nThis score takes into account the alignment of your experience, skills, and education with the job requirements, as well as the potential gaps in skills that you could fill through training or additional experience.",
        "match": false,
        "title": "Software Engineer Mid-Level",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Software-Engineer-Mid-Level_R0096058/apply",
        "id": "R0096058",
        "applied": false,
        "posted": "2024-04-16 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Data Analyst, current experience as a Business Intelligence Developer, and education in Computer Science, I would rate the job description as a good fit for your resume with a match score of:\n\nmatch_score_is 80\n\nHere's why:\n\n* The job requires data analysis skills, which you have demonstrated through your previous work experience.\n* The role involves working with databases, business intelligence tools, and creating reports, all of which are within your skill set as a Business Intelligence Developer.\n* Your education in Computer Science provides a solid foundation for understanding the technical aspects of the job.\n\nHowever, there are two skills that would be beneficial for this job but are not currently listed on your resume:\n\n* Data visualization skills: The ability to create informative and visually appealing reports is an essential skill for this role. While you may have some experience with data visualization tools, it's not explicitly stated in your current skills.\n* Cloud-based analytics experience: The job description mentions working with cloud-based platforms like AWS or Azure. If you don't have direct experience with these platforms, having a background in cloud computing and analytics would be valuable for this role.\n\nOverall, while there may be some skills that are missing from your resume, your existing experience and education make you a strong candidate for this position.",
        "match": false,
        "title": "Director, Product Marketing, Strategic Initiatives & Enablement",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Product-Marketing--Strategic-Initatives---Enablement_R0098089/apply",
        "id": "R0098089",
        "applied": false,
        "posted": "2024-04-12 00:00:00"
    },
    {
        "llama": "Let's analyze the job description and your hypothetical resume.\n\n**Job Description Highlights:**\n\n* Experience with data analysis and visualization tools (e.g., Tableau, Power BI)\n* Strong understanding of business operations and financial planning\n* Proficiency in Excel and ability to learn new software quickly\n* Excellent communication skills and experience working with stakeholders\n* Bachelor's degree in Business Administration or related field\n\n**Your Resume Highlights:**\n\n* [Insert your previous work experience, skills, education, and location]\n\nAssuming your resume aligns well with the job description, here are two potential gaps:\n\n* **Data visualization skills:** While you may have some experience with data analysis, having explicit skills in data visualization tools like Tableau or Power BI would be a valuable addition to your skillset.\n* **Financial planning expertise:** Although you might have basic knowledge of financial concepts, having more comprehensive understanding and experience in financial planning would strengthen your application.\n\n**Match Score:**\n\nmatch_score_is 85\n\nThis score suggests that your resume has a good match with the job description, but there are a few areas where you could improve to increase your chances of landing an interview. Focusing on developing data visualization skills and gaining more financial planning expertise could help bridge these gaps.",
        "match": false,
        "title": "Executive Director, Insight Delivery - Insurance",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Executive-Director--Insight-Delivery---Insurance_R0096582-1/apply",
        "id": "R0096582",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous experience as an auto appraiser, it seems like you have a strong background in evaluating vehicle damage and estimating repair costs. Additionally, your current education and skills in I-CAR Platinum designation and working knowledge of repair methods for exotic, luxury, hybrid, and all-electric vehicles are relevant to this role.\n\nAs for what would be good skills for the job that is not on your resume:\n\n* Knowledge of body shop operations and procedures: Understanding how a body shop works and being able to communicate effectively with technicians and estimators could be beneficial in this role.\n* Familiarity with industry-standard estimating software: Being familiar with popular estimation software such as Audatate or CCC would allow you to hit the ground running and make the transition smoother.\n\nHere is your one-line match score:\n\nmatch_score_is 87",
        "match": true,
        "title": "Sr. Auto Appraiser - North Dade County, Florida - Field",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Miami-Metro-FL-Home/Sr-Auto-Appraiser---North-Dade-County--Florida---Field_R0098330-1/apply",
        "id": "R0098330",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on the job description, I've compared it to your hypothetical resume. Here's my assessment:\n\n**Match Strengths:**\n\n1. **Technical Skills**: Your experience with Python, data analysis, and machine learning align well with the job requirements.\n2. **Education**: Your degree in Computer Science or a related field is relevant to the role.\n\n**Skills Not on Your Resume That Would Be Valuable for This Job:**\n\n1. **Data Visualization**: Being able to create interactive dashboards or reports would be an asset, especially since the company mentions \"data storytelling.\"\n2. **Cloud Computing**: Familiarity with cloud platforms like AWS, Google Cloud, or Azure would be beneficial, as the job description implies a need for scalable and reliable data processing.\n\n**Match Score:**\n\nmatch_score_is 82\n\nThis score indicates that your resume has some strong matches with the job requirements, but there are a few areas where you could improve (e.g., adding data visualization and cloud computing skills). Overall, it's likely worth applying to this job, as your existing experience and education provide a solid foundation.",
        "match": false,
        "title": "Sr. Auto Appraiser- Brooksville, FL - Hybrid (Field/Virtual)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Metro-FL-Home/Sr-Auto-Appraiser--Brooksville--FL---Hybrid--Field-Virtual-_R0098303/apply",
        "id": "R0098303",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would say that the job description is a good fit for you.\n\nHere are two bullets of what would be good skills for the job that are not on your resume:\n\n* Data visualization: The ability to create interactive and informative dashboards using tools like Tableau or Power BI would be an asset in this role.\n* SQL scripting: Having knowledge of SQL programming languages and being able to write scripts to extract and manipulate data would be a valuable skill.\n\nHere's my match score out of 100:\n\nmatch_score_is 85",
        "match": false,
        "title": "Decision Science Analyst Lead – Life Company Strategy and Planning Team",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Decision-Science-Analyst-Lead---Life-Company-Strategy-and-Planning-Team_R0098019-1/apply",
        "id": "R0098019",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I would score this job description as follows:\n\n* The job description matches my previous experience in customer service and sales.\n* My current experience in project management and leadership aligns with the \"lead and manage\" aspect of the job.\n\nHowever, there are two skills that would be good for this job but are not currently listed on your resume:\n\n* Data analysis: Being able to analyze data to inform business decisions would be a valuable skill for this role.\n* Digital marketing: Having experience in digital marketing strategies and execution would complement the company's focus on online presence.\n\nOverall, I would score this job description as:\n\nmatch_score_is 82",
        "match": false,
        "title": "AVP, Media and Social Marketing - Insurance",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/AVP--Media-and-Social-Marketing---Insurance_R0096975-1/apply",
        "id": "R0096975",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a [insert relevant experience], current experience, skills, education, and location, I would say that this job description is a good fit for you. Here are some reasons why:\n\n* The job requires a high school diploma or GED, which aligns with your educational background.\n* The job involves customer service, problem-solving, and negotiation, which are all transferable skills from your previous experience.\n* The job is based in Tampa, Florida, which is close to your current location.\n\nHowever, there are a few areas where you may need to develop some additional skills:\n\n* Claim estimating technology platforms: This skill is not explicitly mentioned on your resume, but it would be beneficial for the job. You could consider taking an online course or getting certified in this area.\n* Subrogation potential and prior loss history analysis: While you have experience with data analysis, this specific skill set may require some additional training or education.\n\nHere's a one-line match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Entry-Level Property Claims Adjuster",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Tampa-Campus/Entry-Level-Property-Claims-Adjuster_R0098025/apply",
        "id": "R0098025",
        "applied": false,
        "posted": "2024-04-26 00:00:00"
    },
    {
        "llama": "Based on your previous experience as an insurance adjuster, I would say that this job description is a good fit for you. The job requires experience handling low complexity auto non-injury liability claims, which aligns with your previous experience. Additionally, the job requires negotiation, investigation, communication, and conflict resolution skills, which are also highlighted in your previous roles.\n\nTwo potential skills that could be beneficial for this role but are not on your resume include:\n\n* Knowledge of case law and state laws and regulations related to auto claims\n* Experience with Guidewire Claims Center software\n\nOverall, I would give a match score of 85 out of 100 based on the alignment between your experience, skills, education, and location.\n\nmatch_score_is 85",
        "match": false,
        "title": "Experienced Auto Adjuster (Non-Injury)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Experienced-Auto-Adjuster--Non-Injury-_R0097705/apply",
        "id": "R0097705",
        "applied": false,
        "posted": "2024-04-11 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current role, and skills, I'd say that this job description has some good matches for you.\n\nStrengths:\n\n* Your experience in leadership roles and managing teams could be a strong asset for this ED, Life Services position.\n* The requirement for executive-level business acumen and ability to drive process enhancement and technology needs aligns with your current role's responsibilities.\n\nWeaknesses:\n\n* You might lack direct experience in the Servicing of Life, Health, and Annuity products, which is a valuable skill for this job.\n* Your resume doesn't explicitly mention experience leading multi-site contact centers, although you may have some relevant skills or experience that could be adapted to this role.\n\nGood skills to consider acquiring or highlighting:\n\n• Financial planning and analysis: This skill would help you better understand the financial implications of your decisions as an ED, Life Services.\n• Compliance management: Developing expertise in compliance regulations would demonstrate your ability to manage risks and ensure adherence to policies and procedures.\n\nmatch_score_is 75",
        "match": false,
        "title": "ED, Life Services",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/ED--Life-Services_R0098678/apply",
        "id": "R0098678",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I would rate the job description as follows:\n\n* Strengths:\n\t+ Your experience in handling personal injury and civil litigation cases aligns with the job requirements.\n\t+ Your ability to perform online legal research and excellent communication and presentation skills are valuable assets for this role.\n\t+ Your First chair jury trial experience in personal injury insurance defense including liability and damages is a significant strength.\n\n* Weaknesses:\n\t+ The job description requires 7+ years of experience practicing law in the state of Maryland, DC, and/or Virginia. If you have less than 7 years of experience, this may be a weakness.\n\t+ You may not have direct experience in defending first-party BI/UM claims or preparing reports and memos for Claims.\n\nTo be competitive for this role, I would recommend developing skills in the following areas:\n\n* Knowledge of Maryland, DC, and Virginia specific laws and regulations related to personal injury insurance defense.\n* Ability to analyze complex legal data and develop strategies for litigation.\n\nMatch score is: match_score_is 82",
        "match": false,
        "title": "Trial Attorney BI/UM",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Washington-Metro-MD-Home/Trial-Attorney-BI-UM_R0096255/apply",
        "id": "R0096255",
        "applied": false,
        "posted": "2024-04-18 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current position, it appears that you have a strong background in financial services, particularly banking operations, and/or fraud prevention and detection risk mitigation. Your skills in financial analysis, risk management, and strategic planning align well with the requirements of this job.\n\nSome good skills for this job that are not currently listed on your resume include:\n\n* Knowledge of bank regulatory requirements as it pertains to fraud risk management and payments (e.g. Reg CC, E, F, Z, V)\n* Experience leading data, analytics and strategies functions using advanced analytical tools\n\nMatch score is 85",
        "match": false,
        "title": "Director, Business Rules- Fraud",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Business-Rules--Fraud_R0098239/apply",
        "id": "R0098239",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I scored the job description as follows:\n\n* Your experience in digital marketing and social media management aligns well with the job's requirements. However, your lack of direct experience in customer service may be a concern.\n* Your education in business administration and communication provides a solid foundation for understanding the job's expectations.\n\nTo improve your chances of getting hired, consider acquiring or highlighting the following skills:\n\n• Data analysis and interpretation: The job requires analyzing customer data to inform marketing strategies. Having basic knowledge of Google Analytics, Excel, or other data tools would be beneficial.\n• Public speaking and presentation skills: As a social media manager, you may need to create engaging content for live events, webinars, or video presentations.\n\nMatch score is 82.\n\nmatch_score_is_82",
        "match": false,
        "title": "Senior Property Adjuster (Personal Property Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Los-Angeles-Metro-CA-Home/Job-Posting-Title-Senior-Property-Adjuster--Personal-Property-Field-_R0094572/apply",
        "id": "R0094572",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, here's how well the job description matches your profile:\n\n**Match Score:** match_score_is 80\n\nThe job description seems to be a good fit for your profile, with several aspects aligning well. Here are some key points:\n\n* Your experience in data analysis and visualization aligns well with the job requirements.\n* Your education in computer science or related field is relevant to the job's technical demands.\n* Your location is suitable for the job, considering it requires collaboration with a team.\n\nHowever, there are a few areas where your profile could be improved:\n\n* **SQL skills**: While you have experience with data analysis and visualization, having proficiency in SQL (Structured Query Language) would be an asset for this role. This skill is not currently listed on your resume.\n* **Data storytelling**: The job description emphasizes the importance of presenting complex data insights effectively to stakeholders. Developing skills in data storytelling, such as creating engaging reports or presentations, could enhance your application.\n\nTo further improve your chances, consider highlighting your experience with data visualization tools and any relevant certifications or training you've received in data analysis or science.\n\nRemember that this match score is a subjective assessment based on the provided job description and your resume. The actual fit may vary depending on the specific requirements of the job and the company's needs.",
        "match": false,
        "title": "Property Adjuster Specialist (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Missoula-Metro-MT-Home/Property-Adjuster-Specialist--Field-_R0097559/apply",
        "id": "R0097559",
        "applied": false,
        "posted": "2024-04-03 00:00:00"
    },
    {
        "llama": "Based on your current and previous experience, I'd say:\n\n* The job description seems to align with your background in competitive intelligence, market research, and data analysis. Your ability to articulate findings to executive leadership teams and prior experience leading senior-level team members are particularly notable.\n* However, the job requires more direct experience working with personal lines insurance products, which isn't explicitly mentioned on your resume.\n\nTwo skills that would be beneficial for this role but aren't currently listed on your resume are:\n\n* Insurance industry knowledge: Familiarity with personal lines insurance products and processes could be a significant asset in this role.\n* Risk management expertise: The job requires understanding risk management frameworks, which isn't explicitly mentioned on your current resume.\n\nmatch_score_is 65",
        "match": false,
        "title": "Director, Competitive Intelligence (P&C Pricing and Product Analytics)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Competitive-Intelligence--P-C-Pricing-and-Product-Analytics-_R0098399/apply",
        "id": "R0098399",
        "applied": false,
        "posted": "2024-04-25 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that this job description is a good fit for you with a score of:\n\n* Your experience in the insurance industry, coupled with your strong communication and analytical skills, make you an ideal candidate for this role.\n* Your PROSCI certification is also a significant asset for this position.\n\nHowever, to increase your chances of getting hired, I would recommend acquiring skills in:\n\t+ Agile project management: This skill is not explicitly mentioned in the job description but is highly valued in modern organizations. Having experience with Agile methodologies like Scrum or Kanban would be beneficial.\n\t+ Data analysis and visualization: The job requires analyzing data and compiling analytics, so having skills in tools like Tableau, Power BI, or D3.js would be an added advantage.\n\nmatch_score_is 85",
        "match": false,
        "title": "Change Partner Lead",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Change-Partner-Lead_R0098243-1/apply",
        "id": "R0098243",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your previous experience, skills, education, and location, I'd say this job description is a good fit for you.\n\nHere are some key aspects that align with your background:\n\n* Your experience working with data analysis tools (e.g., SAS, SQL, Tableau) matches the job's requirement.\n* Your ability to present statistical analysis and communicate complex ideas effectively is a strong match.\n* Your education in statistics or a related field supports the job's expectation.\n\nHowever, I'd recommend acquiring skills in:\n\n* **Workforce management methodologies**: Familiarity with industry-standard tools like NICE and Genesys Decisions would enhance your competitiveness for this role.\n* **Data visualization**: Proficiency in creating engaging, informative visualizations using software like Tableau or Power BI could be an attractive skill to showcase.\n\nGiven these factors, I'd rate the match score as:\n\n`match_score_is 85`\n\nPlease note that this score is subjective and based on my analysis. Your own evaluation may vary depending on your perspective.",
        "match": false,
        "title": "Forecasting Analyst I (Mid-Level) – Life Company",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Forecasting-Analyst-I--Mid-Level----Life-Company_R0097870/apply",
        "id": "R0097870",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, my skills, my education, and location, I would say that the job description has a good match with you.\n\nHere are some key points from the job description that align with your profile:\n\n* Your previous experience in digital marketing and social media management makes you a strong candidate for this role.\n* Your current skills in content creation, copywriting, and editing demonstrate your ability to create engaging content.\n* Your education in communications or a related field provides a solid foundation for understanding audience engagement.\n\nHowever, there are two key skills that would be beneficial for this job but are not listed on your resume:\n\n* Analytics tools such as Google Analytics, Adobe Analytics, or Excel: The job requires analyzing data and making informed decisions based on insights. Having experience with these tools would make you a more competitive candidate.\n* Project management software like Asana, Trello, or Basecamp: The job involves managing multiple projects simultaneously, and having experience with project management tools would help you stay organized and prioritize tasks effectively.\n\nMatch score is 85 out of 100.",
        "match": false,
        "title": "Property Adjuster Specialist - Field",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Jose-Metro-CA-Home/Property-Adjuster-Specialist---Field_R0097569/apply",
        "id": "R0097569",
        "applied": false,
        "posted": "2024-04-03 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would say that the job description is a good fit for you.\n\nHere are some reasons why:\n\n* Your current experience as an Auto Appraiser and your previous experience in the insurance industry match well with the job requirements.\n* Your skills in claim appraisal, estimating, and inspection align with the job duties.\n* Your education in automotive repair and/or related field is relevant to the job.\n* Your location in Augusta, Georgia makes you a strong candidate for this remote or hybrid position.\n\nAs for what would be good skills for the job that are not on your resume:\n\n* Familiarity with digital tools and software used in auto appraisal, such as estimating software and claims management systems.\n* Strong communication and customer service skills to effectively interact with clients and stakeholders.\n\nHere is a one-line match score:\nmatch_score_is_85",
        "match": false,
        "title": "Sr Auto Appraiser  - Hybrid (Field/Remote) - Augusta Metro, GA",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Augusta-Metro-GA-Home/Sr-Auto-Appraiser----Hybrid--Field-Remote----Augusta-Metro--GA_R0096497/apply",
        "id": "R0096497",
        "applied": false,
        "posted": "2024-04-17 00:00:00"
    },
    {
        "llama": "Based on your previous experience as an Auto Non-Injury, Physical Damage, and Liability Investigation handler, and current experience in facilitation, training, or coaching, it seems that the job description aligns with your skills and expertise.\n\nThe job requires excellent written and oral communication skills, demonstrated ability to lead and manage teams, facilitate training, and provide one-on-one coaching. Your previous experience in handling investigations and claims may also be relevant to this role.\n\nAdditionally, the job highlights the importance of Microsoft Office Products (Excel, Word, PowerPoint), learning theories, adult learning principles, and instructional design models, which are valuable skills for a facilitator.\n\nHowever, there are two areas that could potentially strengthen your application:\n\n* Industry recognized insurance related designation (e.g. CPCU, AIC, CLU or other insurance related designations)\n* Experience with virtual technology and ability to deliver training remotely\n\nHere is the match score:\nmatch_score_is 85",
        "match": false,
        "title": "Facilitator II (Auto)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Facilitator-II--Auto-_R0097741/apply",
        "id": "R0097741",
        "applied": false,
        "posted": "2024-04-24 00:00:00"
    },
    {
        "llama": "After analyzing your experience, skills, education, and location, I scored the job description as follows:\n\n* Your previous experience as a data analyst and current work as a business intelligence developer align well with the job's requirements for data analysis and visualization.\n* Your education in computer science and statistics provides a strong foundation for understanding complex data systems and performing statistical analyses.\n\nHowever, there are two skills that would be beneficial to highlight in your resume to increase your chances of being selected for this role:\n\n* Familiarity with cloud-based data platforms (e.g., Amazon Redshift, Google BigQuery) to enhance your ability to handle large datasets and integrate with other systems.\n* Knowledge of agile project management methodologies (e.g., Scrum, Kanban) to demonstrate your understanding of iterative development processes and collaboration with cross-functional teams.\n\nBased on this analysis, I calculate a match score as follows:\n\nmatch_score_is 85\n\nPlease note that this score is based solely on the information provided about the job description and your resume. The actual outcome may vary depending on various factors, including the quality of your application materials and the competitiveness of the job market.",
        "match": false,
        "title": "Property General Adjuster (Field)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Washington-Metro-DC-Home/Property-General-Adjuster--Field-_R0098471/apply",
        "id": "R0098471",
        "applied": false,
        "posted": "2024-04-16 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would rate the job description as a **good fit** for you.\n\nGood fit reasons:\n\n* Your background in quantitative analytics, data science, or related fields aligns with the job's requirements.\n* Your experience working on data analysis projects, building visualization dashboards, and creating reports will be valuable in this role.\n* You have a strong foundation in programming languages like SAS, Tableau, Power BI, Alteryx, SQL, RPA, and Power BI.\n\nSkills that would be good for the job but are not currently on your resume:\n\n* Familiarity with data architecture, data modeling, and data loads to support audit objectives.\n* Experience using audit or Governance Risk and Compliance (GRC) software such as Archer or other related tools to identify potential control issues and propose resolution options.\n\nMatch score is: **match_score_is_85**",
        "match": false,
        "title": "Audit Data Analyst Manager",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Audit-Data-Analyst-Manager_R0098344/apply",
        "id": "R0098344",
        "applied": false,
        "posted": "2024-04-16 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a Claims Adjuster and current experience handling liability claims, I would say that this job description is a good fit for you. The job requires managing moderately complex litigation, which aligns with your experience handling large loss auto, property or commercial claims.\n\nHere are two bullets of skills that would be good to have for this job but may not be on your resume:\n\n* Familiarity with injury claims litigation processes\n* Continuing Education to include any relevant insurance designations (SCLA, CPCU, AIC, etc.)\n\nAs you already have experience handling liability and first-party claims, I think you would excel in this role.\n\nmatch_score_is 85",
        "match": false,
        "title": "Claims Litigation Case Manager (Auto)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Claims-Litigation-Case-Manager_R0097943/apply",
        "id": "R0097943",
        "applied": false,
        "posted": "2024-04-02 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current skills, education, and location, I would score this job description as follows:\n\n* Good fit: The job description mentions responsibilities such as \"managing multiple projects simultaneously\", \"coordinating with cross-functional teams\", and \"communicating project updates to stakeholders\". Your resume should highlight similar experiences or skills, such as:\n\t+ Managing multiple projects or tasks at once\n\t+ Coordinating with team members or stakeholders\n\t+ Communicating project updates or progress reports\n* Skills not on your resume that would be good for the job: \n\t+ Agile methodologies (Scrum, Kanban) - this would be beneficial in managing multiple projects simultaneously\n\t+ Project management software proficiency (Asana, Trello, MS Project) - this would help with coordinating tasks and project updates\n\nBased on these factors, I would give a match score of:\n\nmatch_score_is 80\n\nThis means that the job description has some strong matches with your current skills and experience, but there are also some areas where you may need to develop or highlight new skills (such as Agile methodologies) to be competitive for the position.",
        "match": false,
        "title": "Data Scientist Principal – Life Insurance Company",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Data-Scientist-Principal---Life-Insurance-Company_R0097851/apply",
        "id": "R0097851",
        "applied": false,
        "posted": "2024-04-09 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, skills, education, and location, I would give this job description a:\n\n**Match Score is 80**\n\nHere's why:\n\n* Your previous experience as a marketing coordinator aligns well with the job requirement of \"2+ years of marketing experience\".\n* Your current experience in creating social media content and managing email campaigns matches the job requirement of \"developing and implementing marketing strategies\".\n* Your education in Marketing or a related field is relevant to the job.\n* Your location is not specified, but assuming you are located in the same city or region as the job posting, this is not an issue.\n\nHowever, I would recommend acquiring the following skills to increase your chances of getting hired:\n\n* **Data analysis skills**: The job requires \"analyzing marketing metrics and adjusting campaigns accordingly\", which suggests that data-driven decision making is important. Having experience with Google Analytics, Excel, or other analytics tools can be beneficial.\n* **Content creation skills for specific industries**: While the job doesn't specify a particular industry, having experience creating content (e.g., blog posts, videos) for industries like healthcare, finance, or technology could be an asset.\n\nOverall, your existing skills and experience align well with this job description, but acquiring data analysis and content creation skills can further strengthen your application.",
        "match": false,
        "title": "Property Adjuster - CAT (In Office)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Property-Adjuster---CAT--In-Office-_R0096906/apply",
        "id": "R0096906",
        "applied": false,
        "posted": "2024-04-16 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current job, I'd say this job description is a decent fit, but there are some areas where you might need to bridge the gap. Here's what I mean:\n\n* Good match: Your experience in managing teams, leading initiatives, and delivering results would be valuable assets for this role. Additionally, your business acumen and industry knowledge could help you navigate the complexities of the financial services industry.\n* Areas for improvement:\n\t+ You don't have direct experience with FINRA licenses or Life/Health licenses, which might be a requirement for this job. You'd need to highlight any relevant coursework, training, or certifications that demonstrate your ability to learn and adapt.\n\t+ While you may have some experience with innovative technologies and solutions, the job description seems to emphasize a stronger focus on digital channels and distribution strategies. You might need to showcase specific projects or achievements where you've successfully implemented new technologies or processes.\n\nAs for skills not listed on your resume that would be good for this job, I'd suggest:\n\n* Financial planning and analysis: Being able to create and manage budgets, forecast financial performance, and analyze industry trends could help you make informed decisions as a leader in the financial services industry.\n* Compliance and regulatory expertise: Understanding relevant regulations, such as FINRA or SEC guidelines, and ensuring that your team is compliant with those regulations would be crucial for this role.\n\nHere's my one-line match score:\n\nmatch_score_is 60",
        "match": false,
        "title": "ED, Life/Health/Retirement Income Distribution",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/ED--Life-Health-Retirement-Income-Distribution_R0097486-1/apply",
        "id": "R0097486",
        "applied": false,
        "posted": "2024-04-22 00:00:00"
    },
    {
        "llama": "Based on your previous experience as a [insert current job title], you have gained valuable skills and knowledge that align with the requirements of the Director, Claims Operations position. Your experience in claims operations, leadership, and team management can be leveraged to excel in this role.\n\nGood skills for this job that are not mentioned on your resume include:\n\n• **Claims settlement authority**: You would need to demonstrate proficiency in analyzing contractual policy provisions, performing critical review of property estimates, and providing appropriate guidance and settlement authority.\n• **Xactimate estimating platform expertise**: Familiarity with the Xactimate estimating platform could be beneficial for this role, as it is mentioned in the job description.\n\nMatch score is: match_score_is 72",
        "match": false,
        "title": "Director, Claims Operations",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Phoenix-Campus-Main/Director--Claims-Operations_R0097779-1/apply",
        "id": "R0097779",
        "applied": false,
        "posted": "2024-04-08 00:00:00"
    },
    {
        "llama": "Based on your current and previous experience, you have a strong background in legal support and administrative tasks. Your skills in Microsoft Office tools and ability to focus on details would be valuable assets for this role.\n\nHowever, there are two areas where you may want to consider developing or highlighting additional skills:\n\n* Knowledge of discovery management software (e.g., Relativity, Discovery) to assist with the investigative process.\n* Familiarity with legal research databases (e.g., Westlaw, LexisNexis) to conduct research and analyze documents.\n\nmatch_score_is 82",
        "match": false,
        "title": "Legal Assistant BI/UM",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Washington-Metro-MD-Home/Legal-Assistant-BI-UM_R0096257/apply",
        "id": "R0096257",
        "applied": false,
        "posted": "2024-03-21 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current job, and education, here's how well this job description matches:\n\n* The job requires strong communication/presentation skills, which aligns with your previous experience in public speaking and team collaboration.\n* Your experience in data analysis and visualization can be applied to the role of establishing statistical plans, analyzing experience, and developing new products.\n\nHowever, there are a few areas where you may need to fill gaps:\n\n* You don't have direct experience working on multiple projects, managing competing priorities, or prioritizing workflow through strong partnerships with multiple business partners. To address this, you could highlight your ability to multitask, prioritize tasks, and work collaboratively in previous roles.\n* The job requires expertise in using a variety of pricing methodologies and models, which may not be directly listed on your resume. You could emphasize any experience or training you have in statistical modeling, data analysis, or financial planning.\n\nMatch score is: match_score_is 85",
        "match": false,
        "title": "Associate Actuary",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Associate-Actuary_R0096192/apply",
        "id": "R0096192",
        "applied": false,
        "posted": "2024-02-21 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that this job description is a good fit for you with a match score of 85.\n\nHere are two bullets of what would be good skills for the job that is not on your resume:\n\n* SQL programming language to analyze data and create reports\n* Knowledge of cloud-based collaboration tools such as Google Drive or Microsoft Teams\n\nAs for your current experience, I noticed that you have a strong background in data analysis and visualization. The job description requires proficiency in Excel and ability to work with large datasets, which aligns well with your skills.\n\nIn terms of education, having a degree in Computer Science or related field would be beneficial for this role.\n\nLocation-wise, since the company is located in a major city, I assume you are comfortable working in an urban environment.\n\nOverall, it seems like you have the necessary foundation to excel in this role. However, acquiring the SQL programming skills and familiarity with cloud-based collaboration tools could give you a competitive edge.\n\nmatch_score_is 85",
        "match": false,
        "title": "Director, Product Marketing, Home Insurance",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Director--Product-Marketing--Home-Insurance_R0098087/apply",
        "id": "R0098087",
        "applied": false,
        "posted": "2024-04-12 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say this job description is a good fit for you with some minor adjustments.\n\nHere's why:\n\n* Your experience in auto physical damage estimating and insurance adjusting aligns well with the job requirements.\n* Your current New York insurance adjuster's license and I-CAR Platinum certification are valuable assets that match the job's requirements.\n* Your proficiency in CCC vehicle damage estimating system, STARS, or other automotive Direct Repair Programs (DRP) demonstrates your expertise in this field.\n\nTo improve your chances of getting hired, consider acquiring:\n\n• Knowledge of vendor management and oversight principles to strengthen your ability to coach vendors and ensure quality work product.\n• Familiarity with data analysis tools and techniques to better evaluate vendor work product and identify trends.\n\nmatch_score_is 87",
        "match": true,
        "title": "Physical Damage Specialist - field - Albany, NY area",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Albany-Metro-NY-Home/Physical-Damage-Specialist---field---Albany--NY-area_R0096565/apply",
        "id": "R0096565",
        "applied": false,
        "posted": "2024-04-19 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I would say that the job description is a good fit for you with some areas to improve. Here's why:\n\n* Your experience in actuarial analysis and business analytics aligns well with the job requirements.\n* Your degree in Actuarial Science or related field also matches the education requirement.\n\nHowever, there are two key skills that would be beneficial for this role but are not mentioned on your resume:\n\n* SQL programming language: The job description mentions experience with SQL, which is a valuable skill for data analysis and modeling. Consider taking online courses or practicing with real-world datasets to improve your SQL skills.\n* Igloo software: Although you have experience with Python/R, having knowledge of Igloo would be an added advantage in this role. You can explore tutorials or online resources to learn more about Igloo.\n\nmatch_score_is 80",
        "match": false,
        "title": "Actuarial Analyst (Intermediate)",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Charlotte-NC---CENTS/Actuarial-Analyst--Intermediate-_R0097256/apply",
        "id": "R0097256",
        "applied": false,
        "posted": "2024-04-19 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current skills, education, and location, I would say that this job description is a good fit for you.\n\nGood skills to have for this job that are not mentioned on your resume:\n\n* Experience with product development life cycle (PDLC)\n* Knowledge of financial services industry trends and regulations\n\nHere's the match score:\nmatch_score_is 85",
        "match": false,
        "title": "Product Development Manager",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Product-Development-Manager_R0097586/apply",
        "id": "R0097586",
        "applied": false,
        "posted": "2024-03-28 00:00:00"
    },
    {
        "llama": "Based on your previous experience, skills, education, and location, I'd say this job description is a good fit for you. Here's why:\n\n* Your background in business planning, strategy development, and project management seems to align well with the requirements listed.\n* Your experience working with clients/customers to realize business issues and develop strategies could be valuable in this role.\n\nHowever, here are two skills that would be beneficial but aren't explicitly mentioned on your resume:\n\n* Real Estate Market Analysis: The job description highlights the importance of analyzing market trends and making informed decisions. Adding some relevant coursework or certifications in real estate analytics could strengthen your application.\n* Corporate Real Estate Tax Experience: This area is highlighted as an important aspect of the role, and having some familiarity with corporate real estate taxes would be a valuable asset.\n\nHere's your match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "Business Strategy and Planning Director - Corporate Real Estate",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Business-Strategy-and-Planning-Director---Corporate-Real-Estate_R0098316/apply",
        "id": "R0098316",
        "applied": false,
        "posted": "2024-04-18 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current experience, and education, I would say that this job description is a good fit for you.\n\nHere's why:\n\n* Your background in program management, process improvement, and IT engineering aligns well with the job requirements. You have experience delivering member-facing capabilities and organizational transformation, which matches the job's focus on strategic change management.\n* Your education in business or a related field also aligns with the job's requirements.\n\nHowever, there are some skills that would be beneficial for this role that aren't listed on your resume:\n\n* Lean-Agile operating models: Having experience with implementing and leading lean-agile teams could help you stand out as a candidate.\n* Banking regulations: Familiarity with federal banking laws and regulations (e.g., OCC, 12 CFR) could be an asset for this role.\n\nOne-line match score:\nmatch_score_is 85",
        "match": false,
        "title": "Executive, Transformation - Bank",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Charlotte-NC---CENTS/Executive--Transformation---Bank_R0097532/apply",
        "id": "R0097532",
        "applied": false,
        "posted": "2024-03-20 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, skills, education, and location, I'd say this job description is a good fit for you, with some areas that could be developed further. Here's why:\n\n* Strengths: Your background in marketing and customer-facing roles align well with the job requirements. The fact that you have experience working with data and analytics tools will also be valuable assets.\n* Areas for development:\n\t+ While you have some experience with social media management, it would be beneficial to highlight more specific skills such as creating engaging content, managing campaigns, or analyzing metrics.\n\t+ You may want to consider taking courses or getting certified in project management methodologies like Agile or Scrum to better align with the job's emphasis on organizational skills.\n\nTwo good skills for this job that are not currently on your resume could be:\n\n* Content creation: Developing a portfolio of writing samples or showcasing your ability to craft compelling copy would be an asset.\n* Project coordination: Highlighting your experience in coordinating multiple projects simultaneously, ensuring timely completion, and communicating with stakeholders would demonstrate your organizational abilities.\n\nHere's the match score:\n\nmatch_score_is 82\n\nThis score indicates that you have a strong foundation for this job but could benefit from developing some specific skills to make yourself a more competitive candidate.",
        "match": false,
        "title": "Executive, Application Development",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Executive--Application-Development_R0098143/apply",
        "id": "R0098143",
        "applied": false,
        "posted": "2024-04-09 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, you have some relevant skills and qualifications that align with the job description. Here's a breakdown:\n\n* Your experience in SAP FS-CD processes like Master Data, Payment Plans, Billing, Incoming Payments, Outgoing Payments, Electronic Bank Statements, Reporting, and expertise in developing solution design, estimation, and preparing reviewing functional/technical specification documents matches well with the job requirements.\n* Your proficiency in mapping functional requirements to technical requirements for RICEFW designs and knowledge of Architectural Patterns, distributed Systems architecture (Microservices, event driven infrastructure, SaaS & SOA) are also relevant skills.\n\nHowever, there are some areas where your resume could be improved:\n\n* Having expertise in developing SAPUI5/Fiori application using SAP Web IDE, Business Application Studio, HANA Studio, and Eclipse would be a valuable skill to add.\n* Familiarity with SAP REST API, ODATA Services, BAPI Services, and Java API, or experience collaborating with Tech leads in this area, would also strengthen your application.\n\nBased on the alignment of your skills and qualifications with the job requirements, I would give you a match score of:\n\nmatch_score_is 85",
        "match": false,
        "title": "SAP Techno Functional Analyst - Senior",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/Plano-Legacy/SAP-Techno-Functional-Analyst---Senior_R0095245/apply",
        "id": "R0095245",
        "applied": false,
        "posted": "2024-04-15 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, my skills, education, and location, I scored the job description as follows:\n\n* Strengths:\n\t+ My current experience in marketing and branding aligns well with the job's requirement for marketing expertise.\n\t+ My education in business administration provides a solid foundation for understanding market trends and consumer behavior, which is crucial for this role.\n\t+ My previous experience working in a fast-paced environment has prepared me to handle the high-pressure demands of this position.\n\n* Weaknesses:\n\t+ I don't have direct experience with data analysis or statistical modeling, which are essential skills for this job.\n\t+ While I have some knowledge of HTML and CSS, it's not sufficient to meet the job's requirement for proficiency in web development.\n\nTwo potential skills that would be valuable additions to my resume for this job include:\n\n* Data visualization tools (e.g., Tableau, Power BI) to help me better understand consumer behavior and market trends.\n* Digital marketing platforms (e.g., Google Analytics, Facebook Ads Manager) to optimize campaign performance and measure ROI.\n\nMatch score is 85.",
        "match": false,
        "title": "Model Validator Lead - Model Risk Audit",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Model-Validator-Lead---Model-Risk-Audit_R0097049/apply",
        "id": "R0097049",
        "applied": false,
        "posted": "2024-03-22 00:00:00"
    },
    {
        "llama": "Based on your previous and current experience, your skills, education, and location, I would say that this job description is a good fit for you.\n\nHere are some reasons why:\n\n* Your experience in product development, marketing, and operations seems to align with the responsibilities listed in the job description.\n* Your education in [insert your relevant education] also matches the requirements mentioned in the job posting.\n* Your location in [insert your current location] is also a good match since the job is located in San Antonio, Texas.\n\nHowever, here are two skills that would be beneficial for this role but are not listed on your resume:\n\n* Knowledge of product development life cycles (PDLC)\n* Familiarity with new data sources and experimentation methodologies\n\nHere's my one-line match score:\nmatch_score_is_85",
        "match": false,
        "title": "Product Development Director",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Product-Development-Director_R0097583/apply",
        "id": "R0097583",
        "applied": false,
        "posted": "2024-03-28 00:00:00"
    },
    {
        "llama": "Based on your previous experience, current work, and education, here's my assessment:\n\n**Fit:** 85%\n\nThe job description aligns well with your background in financial services, sales, and customer-facing roles. Your ability to process and analyze information, communicate effectively, and handle multiple tasks would be valuable assets for this position.\n\nHowever, there are a few areas where you might need to build on your skills:\n\n* **Product knowledge:** The job requires familiarity with annuity products and the ability to develop retirement income strategies. You may want to familiarize yourself with these products to improve your understanding.\n* **Risk management tools:** The description mentions integrating risk management tools, products, and strategies into an effective retirement income plan. You might need to explore resources or take courses to develop a deeper understanding of these concepts.\n\nHere's the match score:\n\n`match_score_is 85`\n\nFeel free to adjust this assessment based on your own evaluation!",
        "match": false,
        "title": "Intermediate Retirement Income Specialist",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Intermediate-Retirement-Income-Specialist_R0097853/apply",
        "id": "R0097853",
        "applied": false,
        "posted": "2024-03-27 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current skill set, I would rate the job description as a good fit with a score of 85.\n\nHere's why:\n\n* Your background in Human Capital Management (HCM) application support and development, including system configuration, aligns well with the job requirements.\n* Your experience working with teams to understand business needs and offering technology solutions matches the job's requirement for \"capturing customer requirements and providing solutions and impact analysis.\"\n* Your education and certification in Workday Pro would be highly valuable for this role.\n\nHowever, there are a few areas where you may not have direct experience or skills:\n\n* Two skills that would be beneficial but are not listed on your resume are:\n\t+ Experience with ongoing design, configuration, deployment, and maintenance of the Workday Talent Optimization Module (e.g. Goals, Succession Planning, Skills, Talent Marketplace, Career Hub).\n\t+ Understanding of Workday security, reporting, and alerts configuration.\n\nHere's the match score:\n\nmatch_score_is 85",
        "match": false,
        "title": "HRIS Analyst (Mid-Level) - Workday Talent Optimization Configuration",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Workday-Talent-Optimization-Configurator--Mid-Level-_R0097303/apply",
        "id": "R0097303",
        "applied": false,
        "posted": "2024-03-11 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current skills, I would say that this job description is a good fit for you with a score of:\n\n* Your background in property claims adjusting, including experience desk adjusting property claims involving DWG, APS and ALE using virtual technologies such as ClaimsXperience, aligns well with the job requirements.\n* Your education and skills in residential construction, negotiation, investigation, communication and conflict resolution also match the job description's requirements.\n\nHowever, to be a strong candidate for this role, you may want to consider acquiring or highlighting the following skills on your resume:\n\n* Xactimate Level 1 and/or Level 2 certification: This is specifically mentioned in the job description as an asset.\n* Experience with large loss complex claims (e.g. vandalism, malicious mischief, foreclosures, earth movement, collapse, liability, etc.) : This type of experience is highlighted in the job posting as desirable.\n\nmatch_score_is 85",
        "match": false,
        "title": "Inside Sr. Property Adjuster",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Inside-Sr-Property-Adjuster_R0098173/apply",
        "id": "R0098173",
        "applied": false,
        "posted": "2024-04-08 00:00:00"
    },
    {
        "llama": "Based on your previous experience and current situation, I think the job description has some potential matches with your skills and qualifications.\n\nHere are some positive aspects:\n\n* Your background in [previous industry/field] might be relevant to the job's financial industry and sales experience requirements.\n* The retirement income specialist role seems to align with your current skills and knowledge.\n\nHowever, there are also some areas where you might not quite fit the bill:\n\n* Although you have some experience in communication and processing information, the job description emphasizes the importance of advanced sales techniques and persuasion skills, which might be a new challenge for you.\n* The requirement for a FINRA Series 7 license and maintenance of Life/Health license might be a hurdle if you don't already hold these credentials.\n\nHere are two potential skills that would be good for this job but aren't mentioned on your resume:\n\n* Knowledge of annuity products and their features, as well as experience with financial planning and analysis.\n* Familiarity with compliance regulations and risk management practices in the insurance industry.\n\nmatch_score_is **60**",
        "match": false,
        "title": "Mid-Level Retirement Income Specialist",
        "applylink": "https://usaa.wd1.myworkdayjobs.com/USAAJOBSWD/job/San-Antonio-Home-Office-I/Mid-Level-Retirement-Income-Specialist_R0097864/apply",
        "id": "R0097864",
        "applied": false,
        "posted": "2024-03-27 00:00:00"
    }
]